{
    "Product title": "Automatic Soap Dispenser Liquid Touchless,Wall USB Rechargeable 4-Level Adjustable,Large Capacity 14.2oz/420mL Smart Hand Soap Dispenser for Kitchen Bathroom Kids Family",
    "Buy on Amazon": "https://www.amazon.com/dp/B0G2X36FYZ?tag=aijento-20",
    "Price": "$19.69",
    "Current Price": "$19..69",
    "Was": "",
    "Discount": "",
    "Rating": "5.0 / 5.0",
    "Total review": "-1",
    "Brand": "Brand: BRMUEIX",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/41k-14UTbUL._AC_SL1065_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71E7rDt8MIL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71Z3oCWAQbL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71Og1-f6etL._AC_SL1500_.jpg",
    "Key Features": "【Touchless Sensing】:This automatic soap dispenser touchless is equipped with high-sensitivity infrared sensors that detect hands within 0-2.7 inches, You’ll hear a mild \"pumping\" sound during use, which is a sign of the high-performance motor working efficiently. As a premium hand soap dispenser, it’s perfect for busy families, germ-conscious parents, and anyone pursuing a hygienic lifestyle | 【4-Level Volume Adjustment】:whether it’s a small amount for kids’ hand washing or more for heavy-duty cleaning. The unique 10-second continuous flow mode is a game-changer: ideal for the kitchen soap dispenser when tackling greasy dishes, or as a bathroom soap dispenser for self-cleaning routines. | 【IPX5 Waterproof Rating】: This bathroom and kitchen essential soap dispenser boasts a robust IPX5 waterproof rating, protecting it from splashes and damp environments. You can safely place it next to your kitchen sink, in the shower, or near your bathroom faucet—simply keep the sensor and charging port dry to ensure long-term reliable operation. | 【Long-Lasting Battery】:The automatic soap dispenser comes with a USB Type-C charging cable, taking only 3 hours to fully charge its 1200mAh rechargeable battery. A single charge supports up to 5000 dispensing cycles—equivalent to 3 months of daily use (based on 5 uses per day). No more frequent battery replacements, bringing you ultimate convenience | 【Widely Applicable & Multi-Soap Compatibility】:This versatile liquid soap dispenser works flawlessly as a kitchen soap dispenser, bathroom soap dispenser, or even for commercial use in offices, hospitals, and restaurants. It can be placed on countertops or wall-mounted to save space. Compatible with most liquid soaps—dish soap, shower gel, shampoo, hand sanitizer, and facial cleanser",
    "ASIN": "B0G2X36FYZ",
    "Affiliate Link:": "https://www.amazon.com/dp/B0G2X36FYZ?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/9a33e891-9d9a-4a26-acb7-ac9d5bd33fa4.mp4",
    "comment 1": "I will be purchasing more of these!This is a very simple to use easy to fill soap dispenser! It dispenses the perfect amount of foaming hand soap!Charging is done conveniently with a provided USB C cord, and the battery seems to last for quite some time!Filling is super simple, just twist the bottom a quarter turn, it separates and you just fill and replace!I filled it with generic foaming hand soap and it worked perfectly right away.It’s not as large as the photos seem to make it look, I would argue that it’s the perfect size actually. Not very big, and although loud when dry, it’s not at all obnoxious once you have soap in it.It comes with 2 wall mount self adhesive mounts so you can mount on a wall if you’d like.Great sleek design, looks great in many applications. Works great. - Guy Gleason",
    "comment 2": "",
    "comment 3": "",
    "comment 4": "",
    "comment 5": "",
    "Keyword": "foaming soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}