{
    "Product title": "V-TOP Tub Stopper 2 Pack, 6 inches Large Silicone Drain Plug Hair Stopper Flat Suction Cover for Kitchen Gadgets Bathroom Accessories and Laundry",
    "Buy on Amazon": "https://www.amazon.com/dp/B076JD153W?tag=aijento-20",
    "Price": "$4.98",
    "Current Price": "$4..98",
    "Was": "$2.49",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-62,232",
    "Brand": "V-TOP",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61eWg--sxmL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71PZKGXP8QL._AC_SL1000_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71KdJfvVoNL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71OZPEMBu3L._AC_SL1000_.jpg",
    "Key Features": "★ Bathroom must haves, Large, Universal Fit: Diameter 6 inches, Drain cover bathroom tub use in the kitchen, Bathtub drain and Laundry. Patent pending product, counterfeit not allowed. | ★ Pack of 2, 6 inches white and gray soft bathroom sink stopper, washbasin drain stopper, suitable for flat drain, open drain and slightly domed drain, Please note that it is only suitable for flat and smooth surfaces. | ★ Bath tub accessories for women, stocking stuffers for women, sealed perfectly, flat cover will not get into the drain, so won't get moldy, best bathroom finds for shower must haves. | ★Bathroom gadget tub plug stopper silicone materials, won't hurt kids, and easy to clean, a must haves bathtub accessories Christmas gift for your family. | ★ Your search is over, it can be used as a replaceable sink stopper for garbage disposal, the best sink stopper bathtub gadgets for your kitchen, bathroom and laundry.",
    "ASIN": "B076JD153W",
    "Affiliate Link:": "https://www.amazon.com/dp/B076JD153W?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d2d0ce99-b4b6-4d57-bfad-29a5d2254776/default.jobtemplate.hls.m3u8",
    "comment 1": "These are really large and made of good-quality silicone. They cover the drain perfectly and seal very well. The white one matches our shower color nicely, which is a bonus. They work exactly as intended—water does not get through—and they’re easy to clean. Simple, effective, and look great. - Bhanuka Senavirathne",
    "comment 2": "These work awesome. The kids can’t slide them around while being rowdy in the bath. No drop of water will penetrate this drain! - Autumn Grable",
    "comment 3": "These drain stoppers are great.  I do recommend the 6 inch, however, as the smaller ones slip and water runs out.I ordered before and now I am ordering another set in case I lose one. - Linda F.",
    "comment 4": "Definitely works. It’s a littler bigger than expected which makes it a little difficult to store when not in use. It’s too big to sit on the ledge of the bathtub. But it works! And my baby is no longer pulling out the drain during his bath which is exactly what we needed this for - Tori",
    "comment 5": "Lost the stopper to the hall bathroom tub so we bought these. They work VERY WELL/ place them in a wet tub and they seal well. The more water in the tub, the less leakage. Filled the tub during hurricane season and it stayed full for 7 days, though a small weight (we use a brick) on top makes them seal like they are glued on. On sinks, they hold water in perfectly yet are easy to pull off. No complaints at all. - Murphydog 12",
    "Keyword": "tub stopper",
    "Status": "",
    "Total reviews": "2,895"
}