{
    "Product title": "EHZNZIE Shower Curtain Liner Light Weight PEVA, Shower Liner 72x72 Inches, Waterproof, No Chemical Smell with 12 Rust Proof Metal Grommets for Bathroom Shower Curtain, Brown",
    "Buy on Amazon": "https://www.amazon.com/dp/B09SH66RGY?tag=aijento-20",
    "Price": "$6.94",
    "Current Price": "$6..94",
    "Was": "$7.99",
    "Discount": "",
    "Rating": "4.5 / 5.0",
    "Total review": "-22,747",
    "Brand": "Brand: EHZNZIE",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/81dtrym9QVL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81ipBxmtiIL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71VmafWeAlL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/91cKwhT7fRL._AC_SL1500_.jpg",
    "Key Features": "Reliable PEVA shower curtain liner: EHZNZIE shower curtain is made from thoroughly tested PEVA material, which is made to withstand bathroom environments.100% PEVA material that does not let off a chemical smell. PVC-free.PEVA which doesn't expose your family and the environment to harmful chemical fumes.The shower curtain won't emit the harmful chemicals that often come with vinyl or plastic curtains. | Waterproof and easy to clean: It is effortless to maintain and easy to use. You can do a quick rinse and clean up with water or a damp cloth,which ensures that shower curtain remains healthy. It's machine washable, so you don't have to invest in a new one every time you do a deep clean of your bathroom. | EHZNZIE shower liner blends into any bathroom design:As for design, this is a case where we have to give in to the concept that sometimes the classiest things are the most simplistic. It's a no-nonsense pure clear color that will match any bathroom. The PEVA is smooth but highly textured to promote water bead formation and prevent the curtain from soaking.Plus, the curtain has some little well-thought-out extras that make it stand out, including reinforced hole hooks and a weighted hem. | Longer lasting: Rust proof metal grommets allow for easy sliding. Reinforced grommet header and weighted hem ensures its longevity and keeps your curtain in place, throughout long-term use and prevents tearing . | Easy to install: Our shower liner comes with 12 rustproof metal grommets for your easy to install the curtains with the shower curtain rings. An excellent choice for showers and bathtubs in your home, camper, hotels, motels, dorm showers, and perfect for your camp trailer.",
    "ASIN": "B09SH66RGY",
    "Affiliate Link:": "https://www.amazon.com/dp/B09SH66RGY?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/776384b8-5f26-4b9a-8036-66fbeafd2927.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8efc6682-d1f6-4402-9fda-b161e19fb168/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8efc6682-d1f6-4402-9fda-b161e19fb168/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "I’m really impressed with this shower curtain. The material feels sturdy and good quality, not thin or cheap. It fits perfectly in my bathroom and keeps the water inside the shower without sticking to the body.The design looks great and matches the pictures. It was very easy to install and after several uses, it still looks new. Definitely a great value for the price. I would buy it again. - Josue",
    "comment 2": "Great liner for the price. Does the job! - Free Your Mind",
    "comment 3": "Nice and heavy. The magnets are decent, but good be a little stronger. No weird smell when originally removed from the packaging. - Outdoor extension plug",
    "comment 4": "Satisfied with this purchase as I wanted a lighter weight less rigid shower curtain. Serves the purpose and at a reasonable price. - SAK",
    "comment 5": "I got this EHZNZIE shower curtain liner I really should have looked at the description better.Because it says lightweight.It's a solid color which I was impressed with that. I was just looking for something a bit thicker is all.I did pay less than $5 for this, so it's one of those \" you get what you pay\" for kind of things.The legnth is exactly as described, the color is bright and not see through at all.It does serve it's purpose, I'm not sure about how easy it would be to wash because it's plastic. I'm sure you can soak it in the tub with some soaps and even maybe bleach and it'd be fine. I typically don't keep them that long and recently discovered it's recommended to dispose and change these every 6 months. (Who knew ?)The look is good. The only thing I'm worried about is that it's going to stick to me when I take a shower. Which I usually weigh them down anyways with shampoo bottles on the inside when I shower anyways. So it may not be a problem as it is.The legnth is fine and was easy to install bi do appreciate it. But only wish It was thicker is all. Nothing wrong with it. Just a little cheaper is all.Honestly this does deserve 5 stars because it planly states in the description which was my fault for not seeing when I purchased this. So all in all, it's a great value for your money. - Rae wertheimer",
    "Keyword": "shower curtain liner",
    "Status": "",
    "Total reviews": "2,895"
}