{
    "Product title": "Clorox Under-Rim Toilet Bowl Brush with Corner Storage Caddy, 16 x 5 x 5.5 in",
    "Buy on Amazon": "https://www.amazon.com/dp/B00R55CIRQ?tag=aijento-20",
    "Price": "$8.99",
    "Current Price": "$8..99",
    "Was": "$12.99",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-4,447",
    "Brand": "Clorox",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61GcSaqGBiL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71qhe8bnUvL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71HgI+Ti9jL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71WwX90NoeL._AC_SL1500_.jpg",
    "Key Features": "TOILET BOWL BRUSH AND HOLDER SET: Includes an under-rim bowl brush and coordinating caddy for convenient access and discreet storage when not in use | UNDER-RIM BRUSH HEAD: Round brush head with durable bristles and under-rim scrubber makes cleaning hard-to-reach areas in the toilet quick and easy | LONG-LASTING BRUSH FIBERS: Strong brush fibers maintain performance and resist buildup of bacteria, mold, and mildew. | CORNER STORAGE CADDY: Freestanding caddy features a non-slip rubber base and space-saving corner design, and the modern style matches any bathroom decor | SPACE-SAVING DESIGN: Measures 16 Inch x 5 Inch x 5.5 Inch, ideal for discreet storage by the toilet",
    "ASIN": "B00R55CIRQ",
    "Affiliate Link:": "https://www.amazon.com/dp/B00R55CIRQ?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/abb857d3-e97d-42fa-9459-b0073aa9f34c.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4c5c650-fe07-4116-b3f2-eee25bb903bc/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d4c5c650-fe07-4116-b3f2-eee25bb903bc/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "Didn’t think I’d ever be impressed by a toilet bowl brush, but here we are. This thing actually does its job really well—sturdy handle, good grip, and the bristles are firm enough to scrub without splashing everywhere. It reaches under the rim easily and doesn’t feel flimsy or cheap. Cleaning the toilet is still not fun, but this brush makes it way quicker and less annoying. Easy to rinse clean and doesn’t hold onto gross residue. Solid purchase, would definitely buy again - Louie",
    "comment 2": "best toilet brush i've had in a long time. unfortunately i deal with toilet mold and so the brush has begun to mold after only maybe 5 months or so. it's super sturdy and strong and really gets the nasty stuff out! including black mold. - bianca jade",
    "comment 3": "You cannot go wrong with a real bowl brush to get out those hard water stains. My water is very hard, but I really do not enjoy the was softeners make my skin feel. So I do with out but that can cause problems - hard water staining in not often used toilet being one that annoys me the most. This brush and its lie named liquid cleaner really do an amazing job in keeping my bowl nice and clean. I use the other Clorox brush item with Scentiva on off weeks to keep the toilet nice and fresh  .. but this beauty helps me remove the staining the other tiny brush sometimes cannot remove. A good brush. I think you will be happy with it if you suffer from hard water as I do. - WilDotCom",
    "comment 4": "It's a good toilet cleaning product for the price. Appearance: the white colored brush is neatly hidden in the white storage holder. The grey bristles for cleaning under the toilet rim would be better if they were thicker, but it cleans the toilet fine and without much effort. Overall, it's easy to use, and the grip is sturdy. - J S Fl",
    "comment 5": "Just what i was looking for.  The bristles are nice and strong.  Love that it has bristles to clean under the rim.  The price was very good.  This definitely cleans my toilet.  I recommend it. - Chris",
    "Keyword": "toilet brush",
    "Status": "",
    "Total reviews": "2,895"
}