{
    "Product title": "AIZESI 41-144 Inch Heavy Duty Black Tension Curtain Rod - No Drilling, Adjustable, Rust-Resistant for Outdoor, Living Room, Window, Bathroom",
    "Buy on Amazon": "https://www.amazon.com/dp/B0G1YGS5Z8?tag=aijento-20",
    "Price": "$39.99",
    "Current Price": "$39..99",
    "Was": "$42.99",
    "Discount": "-7%",
    "Rating": "4.9 / 5.0",
    "Total review": "-16",
    "Brand": "AIZESI",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61mjm69NM-L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71mysnyLWyL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71qc7jB8Z-L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81zNYX3DzOL._AC_SL1500_.jpg",
    "Key Features": "【Effortless One-Pull Extension & Custom Length】 Say goodbye to complicated adjustments! Our curtain rod features an intuitive one-pull extension system—simply pull to your desired length (41-144 inches) and release. It locks securely with a click, no twisting, no searching for holes. Perfect for wide windows, patio doors, and room dividers up to 144 inches. | 【Heavy-Duty & Sturdy Support】 Built with reinforced 1.26-inch diameter iron tubing and an inner spring mechanism, this tension rod offers exceptional strength. It holds up to 26 lbs, supporting blackout curtains, outdoor drapes, or multiple shower liners without sagging. The oversized end covers distribute weight evenly and protect your walls. | 【No Drilling & Renter-Friendly Installation】 Install in minutes—no tools, no drilling, no screws! Just expand the rod to about 1 inch shorter than your window or doorway, wedge it in place, and tighten. Ideal for all wall surfaces including tile, drywall, glass, and wood. Perfect for apartments, dorms, and homes where drilling isn’t an option. | 【Rust-Resistant & All-Weather Durability】 Designed for both indoor and outdoor use, the rod features a black anti-rust coating with epoxy resin primer and polyurethane topcoat. It resists corrosion in humid environments like bathrooms and patios, ensuring long-lasting performance and aesthetics year after year. | 【Versatile & Multi-Scene Use】 From blackout curtains in the living room to privacy liners in the bathroom, this rod does it all. Use it for windows, showers, closets, balconies, or as a room divider. Its sleek black finish and adjustable length (41-144 inches) make it a perfect fit for any space, style, or function.",
    "ASIN": "B0G1YGS5Z8",
    "Affiliate Link:": "https://www.amazon.com/dp/B0G1YGS5Z8?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/806f6046-496b-4ec8-8487-dde662dfd833/default.jobtemplate.hls.m3u8",
    "comment 1": "Themis is the best tension curtain rod I have ever used in my lifetime.Heavy duty - YES. This beast of a curtain rod is humongous. Just putting it together made me think that I was building a part for a tank.The great thing about this rod is that it comes in extraordinary lengths, and has the capacity to \"kick\" in place instead of just bring hand-tightened into place.First, assemble the rod, then hold up and adjust to just shy of 1 inch, then click it into place with a single twist. You can hear an inner mechanism \"click click click\", as the rod itself forces it's way between walls.This heavy duty tension rod is not coming down. I've hung my bath curtain on it, dried clothes above my bath - and lots of them including jeans,c which weight axton when wet.No slippage, no middle of the night clunks, it even held up when my 25lb catching on the curtains. The tensioner is capable of up to 35lbs.Where was this curtain rod all my life?!Frankly I'm thinking of getting more of these for my closets. At the price they are asking, I can afford such well made curtain rods be sure I can tell they will last. - Mandyvoll",
    "comment 2": "I definitely recommend this tension rod! I ordered it to use on our screened-in patio. I’m going to put up some lightweight curtains to give a little style and give us a bit of privacy.I really didn’t want a curtain rod that I had to screw into the beams. This tension rod is the PERFECT SOLUTION.The directions are excellent. It comes with all of the parts needed to set it up.  It also comes with a hook that you can use to hold the middle of the curtain rod if needed.I would recommend two people to set it up if you’re going to use most of the 144 inches. I felt like a pole vaulter training for the Olympics, that is until I called my son to come help me hold one end. One person can do it, it’s not that heavy. It’s more to get it level.Now I just need to get two more for the other windows and some curtains.  Yay!It’s going to look so nice.I’m just ecstatic I found a long enough tension rod to fit the length of our patio.Yes, I definitely recommend this heavy-duty, black tension rod! - Jess",
    "comment 3": "A well made and excellent quality tension rod that also includes supports for longer extension use with heavy curtains. I like the matte black finish because it doesn’t stand out so the curtains are the primary focus. I did not want to put screws back in the frame around the window, so I appreciate the strong tension strength and grips on the ends that keep it solidly in place. I did not need the rod fully extended, but I’m sure it would still have a solid feel at the maximum length. I’ve had no issues with it slipping down the wall under the weight of the curtains. Highly recommend if you need an adjustable tension curtain rod. - C. Davis",
    "comment 4": "Wow this Heavy Duty black tension rod really does range from 41\" all the way to 144\".  I would've gotten this earlier for a room divider when we have a lot of guests.  I ordered this to fit inside a 44\" wood valance, which it did perfectly.  The instructions and mechanisms worked well, it feels really sturdy and durable.  The grip on the two ends hold strong.  My only mistake was measuring the diameter of the rod incorrectly, so my curtain rings didn't fit.  I have 'tabs' on my curtains as well, so that works even better.  I feel like this rod is really versatile because it can be assembled in sections to make a variety of sizes. Then just twist one end to get the tension you need.  It has a hook, too, to help with sag in the middle if you using the longer sizes.  Really good design.  Just label the parts you aren't using, so you don't lose them and keep the instructions.  I think overall it's a great value. - Julia",
    "comment 5": "This AIZESI tension curtain rod was super easy to install because there was no drilling or tools needed. It was super easy to assemble and I love the adjustable length because it made it easy to fit my windows and the black finish looks clean and modern. This rod feels very sturdy, both during assembly and once in place, and holds heavier curtains without slipping. It came with everything that you need for installation and includes five different sections to assemble based on your desired length.I’ve used this rod in my very large dining room, where I have a wall of windows, about 110” across and it appears to be able to hold all of the curtains well. I highly recommend this rod! - Tootallj",
    "Keyword": "shower curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}