{
    "Product title": "Black Curtain Rings with Clips 1.5 Inch Set of 20 Heavy Duty Curtain Hooks for Drapes, Caps, Pictures - fits on Rod Diameter Upto 1.25Inch/32mm… (Black, 1.5\" Inch - 20 Pack)",
    "Buy on Amazon": "https://www.amazon.com/dp/B08KWM35C2?tag=aijento-20",
    "Price": "$10.47",
    "Current Price": "$10..47",
    "Was": "$12.99",
    "Discount": "",
    "Rating": "4.7 / 5.0",
    "Total review": "-1,354",
    "Brand": "Curtain Clouds",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71CRzmhc3NS._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61h1k3RBGRL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61iwjzqYQNL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71JYuN9YkKL._AC_SL1500_.jpg",
    "Key Features": "Curtain ring inner diameter 1.5 inch/3.81 cm and external diameter 1.77inch/4.5cm. The ring fits up to rod diameter 1.25inch/3.2cm.... | This set of 20 matte black drapery rings offers a sleek and streamlined design to enhance the look of window curtains in your living space. The matte black finish adds a modern touch while providing extra length and neat pleats to your drapes, ensuring a polished and sophisticated appearance. | Use these rings clips to hang fairy lights or pictures to decorate your home or use them in kitchen to hang spices or recipes. They also come in handy to hang bags, caps and other accessories | The curtain hooks with clips are rust resistant and do not break or deform during daily use. Perfectly sized to allow your curtains slide across the rod with ease. Our customer representative team is always there to help you with queries and issues",
    "ASIN": "B08KWM35C2",
    "Affiliate Link:": "https://www.amazon.com/dp/B08KWM35C2?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/588fbb58-01de-4718-bc35-c6a0a49a9f0f/default.jobtemplate.hls.m3u8",
    "comment 1": "These black rings with clips were perfect for the tasks which I had in mind when ordering them on Amazon. They are great considering their functionality because they easily slide onto a curtain bar then you simply squeeze the clips open to insert material to hang over a window.  They look very nice with their durable black finish and were worth every penny because they made all my jobs easier.  I was looking for way to attach my newer dining room curtains which I recently ordered and also obtained from a company on Amazon.  The 1.5 size of the rings measured perfectly for the bar which I purchased to hang the curtains. The clips were so nicely made that it made it easy to open and insert the curtain material. There were so many clips included in this package that I was even able to hang my kitchen curtains and still have some rings left to attach some privacy netting to an additional bar which I needed outside. I'm very pleased with this product and feel I will be back soon to order more in the future. - Raedene S.",
    "comment 2": "Love these! They’ve been holding up my drop cloth curtains for years! Very easy to open and sturdy. Great value! - Melissa McHarg",
    "comment 3": "These curtain rings are great!  I did have to take the the curtain rods out of their holders to put these rings on, but that's the only time.  No more threading drapes or curtains onto the rods--just clip them onto the rings.  They hold securely and it is easier to open and close drapery because the rings slide so easily on the rods.  The rings come in various sizes, colors and finishes.  I prefer shiny silver, which goes well in my opinion with all my curtains. - Just call me Cookie",
    "comment 4": "Works as expected. - Helen Blocker",
    "comment 5": "Well made, sturdy and the spring for the clip is strong.  Ordered these for Drop Cloth Curtains for the porch, Was somewhat apprehensive about these but turned out to work great, The size is good for the curtain rod I used, They look exactly the same as the more expensive clip hooks.  I was able to buy more of these for less money for the big box store clips.  Great Price! Would order again! - Whoknowes",
    "Keyword": "curtain hooks",
    "Status": "",
    "Total reviews": "2,895"
}