{
    "Product title": "Commercial Wall Mounted Soap Dispenser, 1100ML - Stainless Steel, Easy Wall Mount Installation, Anti-Leak Pump, Corrosion Resistant, Ideal for Commercial, Household, Office Use(37.19 fl.oz.)",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FVRXBGVL?tag=aijento-20",
    "Price": "$34.00",
    "Current Price": "$34..00",
    "Was": "",
    "Discount": "",
    "Rating": "5.0 / 5.0",
    "Total review": "-7",
    "Brand": "DUTYWORKS",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71BbQ7SwwpL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71EkoP4+sOL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71ljD6oIu1L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71fbR0gatcL._AC_SL1500_.jpg",
    "Key Features": "Sturdy & Long-Lasting Construction: Built from premium 304 stainless steel, this wall-mounted soap dispenser is corrosion-resistant, durable, and perfect for both high-traffic commercial environments and everyday bathroom use. The sturdy design ensures a long-lasting product that resists wear and tear. | Generous Capacity for Reduced Refills: Featuring a large 1100ml (37 oz) capacity, this stainless steel soap dispenser minimizes the need for frequent refills. Ideal for high-volume areas like offices, restaurants, schools, and home bathrooms, it ensures uninterrupted access to soap throughout the day. | Simple Wall Mount Installation: The wall-mounted soap dispenser comes with an easy-to-install mounting plate and screws, allowing for quick setup in any location. The compact design saves space, and the transparent window lets you easily monitor soap levels, while the lockable top cover ensures secure refills. | Versatile for Various Applications: This commercial soap dispenser is compatible with liquid soap, sanitizer, lotion, or gel soap (non-foaming), making it perfect for diverse settings like hospitals, hotels, restaurants, and home bathrooms. The wall mount hand soap dispenser ensures convenience and hygiene wherever it is placed. | Reliable Quality & Customer Support: DUTYWORKS offers a 1-year warranty on this stainless soap dispenser, ensuring you can rely on its quality and durability. Our dedicated customer service team is always available to assist with any concerns, providing peace of mind with every purchase.",
    "ASIN": "B0FVRXBGVL",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FVRXBGVL?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/927e5b81-bec2-4976-935f-9472e76c6642/default.jobtemplate.hls.m3u8",
    "comment 1": "I picked this up because I wanted a wall-mounted soap dispenser that didn’t need batteries, charging, or special refill bags. I just wanted something simple and tidy for everyday use.This one is stainless steel and has a nice shine to it. It looks clean and modern without being flashy. The size is just right. It’s compact enough to fit almost anywhere I’d want to mount it, in a bathroom or the kitchen, without taking up much space.Installation was straightforward. There’s a small screw inside the top that you loosen so the back plate can slide off. That plate mounts to the wall first, and then the dispenser slides right onto it. The screws are included, which I appreciated. Once it’s mounted, it feels secure.What I like most is how basic it is, in a good way. It’s manual, so there’s nothing to charge and no batteries to replace. I can use my own liquid soap, sanitizer, or lotion without being locked into special refills. You just press the front, and the soap comes out smoothly.The only thing I’d change is the viewing window. There is a window, but it’s pretty small. I’d prefer a larger window, so it’s easier to see when the soap is getting low. It’s a minor thing, but worth mentioning.Overall, this dispenser does exactly what I wanted it to do. It looks nice, mounts easily, and works reliably with no extra fuss. I’ll keep using it and may consider adding another one in a different area. - Jeanie",
    "comment 2": "This stainless steel soap dispenser has exceptional build quality. It is made from 304 stainless steel with an anti-corrosion PE lining. It feels solid and looks sleek in silver. I have not encountered any rust issues. It's made for use in a humid environment, and its vandal-resistant design is great if you have kids who like to mess with things.Installation was simple. The dispenser comes with a mounting plate and screws, and I installed it on the wall in under five minutes without needing to drill new holes. The transparent window allows me to see when it’s time for a refill, and the 27 oz capacity means I don’t have to top it up every few days, which is perfect for me since I have a lot of children and grandkids.It dispenses liquid soap smoothly without drips or clogs. The pump is dependable.The 1year warranty provides me with peace of mind. I highly recommend it for homes, offices, or anywhere durable hygiene gear is needed! - Liz",
    "comment 3": "This DUTYWORKS wall mounted soap dispenser feels like a true commercial-quality product. The stainless steel body is sturdy, looks clean, and doesn’t feel flimsy at all. It fits in nicely in both a home bathroom and more professional-looking spaces.Installation was simple and straightforward, and once mounted it stays secure. The 37oz capacity is a big plus—you don’t have to refill it constantly, which is great for my outdoor bar and sink area. The pump works smoothly and dispenses a good amount of soap without dripping or leaking, which has been an issue with cheaper dispensers I’ve tried. It cleans up the area where the jug of soap was. Check the pictures out.I also like that it’s corrosion resistant and easy to wipe down, so it stays looking nice. Overall, this is a reliable, no-nonsense soap dispenser that feels built to last and does exactly what it’s supposed to do. A good choice if you want something durable and professional-looking. - Kindle Customer",
    "comment 4": "I picked up this stainless steel soap dispenser for my shop and it’s been great. I use it constantly, so having something mounted on the wall just makes sense. My hands are usually messy, and it’s really nice to be able to get soap without having to pick anything up. A quick press and I’m good to go, making handwashing faster and less annoying throughout the day!The large capacity is a big plus. I wash my hands a lot, probably a hundred times a day, so not having to refill it all the time is a relief. Being able to use bulk soap also saves me money, which adds up pretty quickly in a shop setting.The stainless steel works great in a shop too. Looks a lot nicer than a messy bottle of pump soap. - SimplyReviewed",
    "comment 5": "This is a 304 stainless steel, wall mounted soap dispenser. I like to have a soap dispenser at the kitchen sink, for washing dishes and my hands. For years I've been buying the little plastic bottles, which take up counter space, and can make a mess. So I decided to give this wall mounted soap dispenser a try.Installation took about 15 minutes with the included wall anchors and screws. The design is pretty straight forward. Liquid soap goes directly into the container, unlike many other dispensers that use propietary plastic soap bags, which you have to keep purchasing. This dispenser has a PE liner to prevent corrosion, the build seems solid, and it works great. If I had a complaint, it would be that the little window could be bigger, to more easily see when soap is getting low. - Paul C",
    "Keyword": "soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}