{
    "Product title": "Matte Black Bathroom Accessories Set, KLJKPA 4 Pieces Bathroom Hardware Set, 24 inch Towel Bar, Towel Racks for Bathroom, Robe Towel Hooks, Toilet Paper Holder Wall Mounted",
    "Buy on Amazon": "https://www.amazon.com/dp/B0D2KZXT8R?tag=aijento-20",
    "Price": "$16.99",
    "Current Price": "$16..99",
    "Was": "$18.99",
    "Discount": "-11%",
    "Rating": "4.6 / 5.0",
    "Total review": "-1,345",
    "Brand": "KLJKPA",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61ML-XytWhL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71j-td47D-L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61v4M16EenL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71uHA69HF-L._AC_SL1500_.jpg",
    "Key Features": "4-Piece Set. This bathroom hardware set includes a 24 inch towel bar, towel ring, toilet paper holder and towel hook. | High Quality Material. The bathroom accessory set is made of premium metal such as stainless steel and aluminum, solid structure, rustproof and built to last. Smooth surfaces and edges make it easy to hang towels or paper towels. | Well Designed. The surface is matte black finish, can match with any other bathroom fixtures. Great adornment to complement any bathroom. It is perfect to upgrade your bathroom remodel. | Easy Installation. All screws accessories are included in the package, just follow the included directions to install. The sturdy screw base ensures that the them stays securely fastened to the wall and stands up to daily use. | Save Time & Money. The color and style are consistent across all the pieces. 4-Piece bathroom hardware set can meet the needs of the bathroom, no need to spend time and effort to purchase one piece by one piece.",
    "ASIN": "B0D2KZXT8R",
    "Affiliate Link:": "https://www.amazon.com/dp/B0D2KZXT8R?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/92e7fd25-1e78-4e69-b5dd-b2c5eb9d8bd7/default.jobtemplate.hls.m3u8",
    "comment 1": "This brushed nickel bathroom accessories set looks beautiful and feels very sturdy. The finish is sleek and modern, giving my bathroom a more polished look. Installation was simple, and all the pieces feel high-quality for the price. Everything matches perfectly and adds a nice touch of elegance. Highly recommend! - Mily",
    "comment 2": "Good quality and good looking. Hardware all included and easy to mount. Fits well. Very happy with it. Producing is great. - Benjamin C",
    "comment 3": "Very nice bathroom accessories set at a reasonable price that looks nice and very modern looking. Includes adjustable length tile rod, TP holder, hand tile holder. - william calvin",
    "comment 4": "These aren't heavy duty or fancy by any means, but we didn't need that for our project. Clean lines, will work with any decor style, and the provided instructions and hardware made them quick and easy to install. Our bathroom is relatively small and we have towel bars on our shower, so we opted not to install the bar included here, but can use it elsewhere if we want. Cost for this whole set is about what it would cost for just one or two of the pieces in-store, so even without using the towel bar, it's a $$ win. All parts were included in the box. - Kristenc1",
    "comment 5": "This set is beautiful. The matte finish gives an elegance presence. Very sturdy. - Yaya",
    "Keyword": "towel racks for bathroom",
    "Status": "",
    "Total reviews": "2,895"
}