{
    "Product title": "HOOBRO Blanket Ladder, 5-Tier Towel Rack with Hooks, Wall-Leaning Blanket Rack, Decorative Display Ladder Shelf, for Scarves, Industrial, Living Room, Bedroom, Rustic Brown and Black BF52CJ01",
    "Buy on Amazon": "https://www.amazon.com/dp/B0BCG5RX1C?tag=aijento-20",
    "Price": "$24.99",
    "Current Price": "$24..99",
    "Was": "$5.00",
    "Discount": "-22%",
    "Rating": "4.5 / 5.0",
    "Total review": "-1,198",
    "Brand": "HOOBRO",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/51tLiL2gLNL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71sBZb37WsL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61ni+oVsmEL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81kbdIqg3ZL._AC_SL1500_.jpg",
    "Key Features": "Multi-Purpose Application: This blanket ladder can be used in the living room, bedroom, bathroom or any other tight corners for hanging towels, blankets, washcloth, scarves or ornaments, adding an unique vibe for you home | Space Saver: This wall leaning shelf is sized in 17.3\"L x 63\"W with occupying little floor space. 5 shelves are ample for hanging your blankets or bath towels while 4 removable hooks help with your coats, scarves and hats | Solid Structure: The stylish vintage particle board with the high-quality metal frame endows the towel rack with good stability and load-bearing capacity.The blanket rack is also equipped with an anti-tip kit and plastic tube sleeves to increase its stability and effectively prevent the towel holder from scratching the floor | Stylish and Noble: Without complicated patterns and gorgeous decorations, our towel rack design adopts simple lines and clean colors. This can be well integrated into a variety of decoration styles. In addition, it also provides freedom for your room decoration! | Easy to Assemble: With easy-to-understand installation instructions, numbered accessories and mounting tools in the package, you can assemble the ladder shelf quickly and easily",
    "ASIN": "B0BCG5RX1C",
    "Affiliate Link:": "https://www.amazon.com/dp/B0BCG5RX1C?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/931572d6-5c32-4850-a248-a314afbc3754/default.jobtemplate.hls.m3u8",
    "comment 1": "I love it! Keeps my nice blankets and shawls displayed in a pretty, clean manner that keeps them off the floor and free of cat hair. Assembly was quick and easy and it's nice and stable. Exactly what I had in mind! - Vedis Frick",
    "comment 2": "Easy to put together, fits several blankets and looks sleek in the living room. Way cheaper than other ones I’ve seen. - J+H",
    "comment 3": "Love this ladder. Sturdy. Easy to put together. Color is exactly as expected - Jen",
    "comment 4": "Looks great! A little time consuming to put together but it is stable with five medium to heavy blankets on it. The only downfall is that both rungs don't evenly sit against the wall. I would totally purchase again. - Amanda",
    "comment 5": "This ladder shelf was easy to assemble and looks great, just what I was looking for. It comes with hooks on the top which are handy for hanging gloves to dry. The color works nicely in our room. - Maryann Anderson",
    "Keyword": "blanket ladder",
    "Status": "",
    "Total reviews": "2,895"
}