{
    "Product title": "Taozun 67-Inch Wooden Blanket Ladder with Shelf for Living Room - 5-Tier Farmhouse Towels and Quilt Rack Decor - Leaning Wall Display Holder for Blankets and Throws",
    "Buy on Amazon": "https://www.amazon.com/dp/B0F2FB19RF?tag=aijento-20",
    "Price": "$49.99",
    "Current Price": "$49..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.1 / 5.0",
    "Total review": "-173",
    "Brand": "Taozun",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71x1hEya8OL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71CK6PsLTnL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71rDj25Y9xL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71TiAQr5ZIL._AC_SL1500_.jpg",
    "Key Features": "Quality Wood: Farmhouse blanket ladder is made of wood, which is smooth and thick and can easily fit into a variety of home decor styles. 5-tier ladder boards and shelves are carefully sanded and non-slip treated to ensure safety and stability during use. | Structural Stability: Wooden blanket ladder is equipped with non-slip feet at all 4 points of contact with the floor and walls to keep the ladder from slipping during use. The back of quilt ladder is reinforced with iron sheets to improve stability and ensure that the blanket rack does not wobble and bend. | Versatile Blanket Ladder: Blanket Holder has a 16.90\"L x 8.65\"W shelf. When blanket ladder with shelf is against the wall, the shelf is parallel to the floor and can be used to store everyday items such as bath towels and washcloths as well as and greenery, making your bathroom, bedroom, living room and nursery room neat and organized. | Practical Design: Wooden Ladder has 5 tiers each holding 1kg, making it easy to hang heavy blankets. Decorative ladder has a staggered design with protruding ladders on the left and right sides for hanging bags, hats and clothes, making optimal use of space so that hanging items do not overlap. | Decorative Ladder: you can add your decor ideas on this ladder for the coming Christmas, such as blankets and festival ribbons on the tiers, putting some dolls or gift boxes on the top shelf, hanging Christmas stockings on the side-hooks.",
    "ASIN": "B0F2FB19RF",
    "Affiliate Link:": "https://www.amazon.com/dp/B0F2FB19RF?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1723622e-4466-47d6-a42e-545ea5838fe2/default.jobtemplate.hls.m3u8",
    "comment 1": "Very well packed and easy instructions to follow.  Looks beautiful, can now hold my blankets and even I added plants on the top shelf.  Will purchase again.  Stability is good and weighs perfect.  Will purchase again. - Ani",
    "comment 2": "Easy assembly,  looks just like advertisement - Michael Kayleen Martin",
    "comment 3": "This ladder is lightweight and easy to assemble, which is a plus. It holds up well when used to display blankets, and I’ve even received a couple of compliments on its appearance. However, the overall quality feels very cheap, and I was on the fence about keeping it. While it works for light decorative use, I wouldn’t choose this ladder again for myself or as a gift. It’s a decent budget-friendly option but might not meet expectations for durability or premium quality. - Sandra McGarey",
    "comment 4": "It was a little flimsy for the price, and was missing a foot pad, but I made it work. Aside from that, I'm happy with it. Installation was not difficult. It's nice and light. Functionally, I think it will serve it's purpose. - Kristi Solar",
    "comment 5": "",
    "Keyword": "blanket ladder",
    "Status": "",
    "Total reviews": "2,895"
}