{
    "Product title": "Toilet Brush and Holder 2 Pack with Long Handle - Non-Slip Grip Toilet Bowl Brush Set for Deep Cleaning Bathroom, Toilet Scrubber- Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0F941D128?tag=aijento-20",
    "Price": "$7.99",
    "Current Price": "$7..99",
    "Was": "$9.99",
    "Discount": "-20%",
    "Rating": "4.6 / 5.0",
    "Total review": "-466",
    "Brand": "Brand: AONEZ",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61bS-Ue4KgL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71ZUkLqPDZL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71nVJpZdqVL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71epf8UOnRL._AC_SL1500_.jpg",
    "Key Features": "[2 Pack Toilet Scrub Brush] This 2-pack of toilet bowl brushes are perfect for multi-bathroom households—use one for daily cleaning and keep the other as a backup, covering both regular maintenance and deep cleaning needs. | [Ergonomic Handle] The handle of the toilet brush has anti slip texture, which ensures a firm grip even when the hand is wet. The design of the handle conforms to the natural curve of the hand, making scrubbing easier and reducing wrist fatigue during prolonged use. | [Deep Cleaning] The toilet cleaner brush features dense black bristles that are durable and tough on dirt—powerful enough to deliver a full deep clean of the entire bowl, yet gentle enough to avoid scratching the toilet surface. ﻿ | [Space Saving Compact Design] The toilet brush and holder set features a flat base for stable placement. Its compact design fits neatly in small bathrooms, under sinks, or tight corners—no extra space needed. | [Modern Decorative Design] Stylish design can blends nicely with bathroom decor, and toilet bowl scrubber is crafted from thick, durable plastic, which will not cause annoying rusting problems. ﻿",
    "ASIN": "B0F941D128",
    "Affiliate Link:": "https://www.amazon.com/dp/B0F941D128?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83a6b518-589a-45ba-b410-e1daf4badb27/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/83a6b518-589a-45ba-b410-e1daf4badb27/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "These surprised me by how good they are. They do really good. Very easy to assemble, they stay locked in place pretty well, and they're just as tough as a normal toilet brush and I like the fact that they're black instead of the plain ole white ones. Perfect size,and they look better cause of the color, makes them different. - J",
    "comment 2": "Works great, love the color as it matches both of my bathrooms. Super easy to assemble and is super light. The price is fantastic for 2. Recieved them the next day just as it said when I ordered them. - Kara Chipley",
    "comment 3": "Perfect! Our house keeper wanted one, so this is what we got her. She seems very pleased with it as there has been no complaints and she is kinda inclined to complain. But my dad asks me - do you want her job? Obviously not so I just let her complain about things since she is a good cleaner at an affordable price. She is happy with this toilet brush thankfully! - Matt",
    "comment 4": "Cheap butt does the job. Inexpensive cleaner. - Josh",
    "comment 5": "It’s convenient to have a toilet brush next to each toilet.  The holder is sturdy and keeps the brush in an upright position for storage.  The brush quality is surprisingly good (stiff bristles, but not too stiff).  And the shape facilitates easy and thorough cleaning of the tighter bottom sections of the bowl, under the entire rim, and all the surface area in between.  The handle is comfortable.  At first, I kept partially unscrewing the handle from the brush when I shoved the brush down into those tighter angled parts at the bottom of the bowl.  I don’t know if it’s because I’m left handed or just because I was twisting the brush counterclockwise.  I’m now in the habit of twisting clockwise instead.  No more unscrewing.  I’ll definitely reorder these when the time comes.  Hopefully they’ll still be available on Amazon. - K+S in STL",
    "Keyword": "toilet brush",
    "Status": "",
    "Total reviews": "2,895"
}