{
    "Product title": "River Dream Heavyweight No Hooks Required Dotted Waffle Weave Shower Curtain with Snap in Liner，Bathroom Curtains Shower Set - 71W x 74H,Hotel Grade,Spa Like Bath Curtain,White",
    "Buy on Amazon": "https://www.amazon.com/dp/B082NJY2ZY?tag=aijento-20",
    "Price": "$29.99",
    "Current Price": "$29..99",
    "Was": "$35.99",
    "Discount": "-17%",
    "Rating": "4.7 / 5.0",
    "Total review": "-13,815",
    "Brand": "River Dream",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71CXIa3POML._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71nPwMTpBDL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/713RNf-N0HL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71CvtJzbjZL._AC_SL1500_.jpg",
    "Key Features": "100%polyester | Size Notice: The usable size is the same as a regular 71x72 shower curtain,snap in liner is 70\" x 54\" (WxL) | This bathroom curtains shower set designed with \"Split Rings\" that let you hang them easily. No need to buy hooks and no need to remove the rod | A clear window along the top lets light in and allows you to see out while maintaining privacy | Hotel Quality: The shower curtain and liner are made with high quality Fabric, heavy weight to keep it in place. Water repellent treatment can repel the water inside tub",
    "ASIN": "B082NJY2ZY",
    "Affiliate Link:": "https://www.amazon.com/dp/B082NJY2ZY?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ea7eb4bd-9962-4f81-8ecb-37a7214c20c1/default.jobtemplate.hls.m3u8",
    "comment 1": "I looks great; the open top doesn’t shrink the space and the no hooks required made it so easy to install. - P. J.",
    "comment 2": "Easy to install. Great quality and look. Having the liner with the curtain is so easy to use. - Michele",
    "comment 3": "Love this shower curtain.  The sheer panel at the top allows light to come into the shower.  It is a very elegant-looking shower curtain.  Love that there are no shower hooks required.  A much cleaner look. - Blossom",
    "comment 4": "Good quality curtain. I ended up buying two because I wanted to try out the two different colors. They both had good consistent quality. The big challenge may be finding the color that matches your space. I first tried the linen color. I found a bit too dark for a non-window bathroom then I tried the cream color which ended up being very bland for the space so I stuck with the linen. The color, size, length, weight, and thickness all matched expectations. The price was good at Black Friday values, otherwise, I might have been tempted to keep searching for the perfect color for my space. - Zee",
    "comment 5": "Nice quality  A little challenging to hang. Had to pull hard to separate ring openings on a couple of the rings to loop the curtain rings properly.  Looks nice. - kathleen nolan",
    "Keyword": "shower curtain",
    "Status": "",
    "Total reviews": "2,895"
}