{
    "Product title": "Sumnacon Square Linen Tissue Box Cover - Stylish Cube Tissue Box Holder with Magnetic Bottom, Decorative Tissue Box for Vanity Toilet Tank Dresser Night Stand Table Countertop Office Car, Beige",
    "Buy on Amazon": "https://www.amazon.com/dp/B0B2LNF7G6?tag=aijento-20",
    "Price": "$13.99",
    "Current Price": "$13..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.8 / 5.0",
    "Total review": "-2,885",
    "Brand": "Brand: Sumnacon",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71SMUrI0lJL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81d0MCewc8L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61uTZ-OufoL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71HYgZm7l0L._AC_SL1500_.jpg",
    "Key Features": "High Quality - The attractive tissue box cover is made of high quality MDF(inside) + Linen (outside) materials; It's sturdy to keep the tissue box from being crushed; The stitching is not only even and neat, but also contrasts nicely with the beige linen material. | Functional - The stylish and practical cube tissue box can not only be used everywhere in your home, such as: living room, bathroom, vanity, dresser, night stand, table, countertop; But also suitable for office, car, restaurant, bar, hotel or other places. | Stylish Decoration - The simple & classy style square tissue holer is perfect for most home decor, not only match well with your various furniture, but also add more modern touch to your home. | Magnetic Bottom - The bottom plate of the tissue box holder is securely closed by a magnetic closure, so you can easily put tissues or tissue box in, and without worrying about the tissues or tissue box will fall through when you pick it up. | Suitable Size - Product External Size: 5.2\" L X 5.2\"W X 5.8\"H; It's suitable for a regular or standard cube of Kleexxx brand tissue box, so you don't need to remove the tissues from the original box.",
    "ASIN": "B0B2LNF7G6",
    "Affiliate Link:": "https://www.amazon.com/dp/B0B2LNF7G6?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b18ddcf7-69b5-4fd2-a891-61ea2da9e9d5/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b18ddcf7-69b5-4fd2-a891-61ea2da9e9d5/videopreview.jobtemplate.mp4.default.mp4,default,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b18ddcf7-69b5-4fd2-a891-61ea2da9e9d5/fb82b759-f9a7-458b-bc5a-ea80c9db799e/01b16940f37542248ce28f05bba85e6a_0-100-0-100_gandalf_preview.mp4,gandalfMp4,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b18ddcf7-69b5-4fd2-a891-61ea2da9e9d5/fb82b759-f9a7-458b-bc5a-ea80c9db799e/01b16940f37542248ce28f05bba85e6a_0-100-0-100_gandalf_preview.m3u8",
    "comment 1": "I just ordered my third Sumnacon square linen tissue box cover. This tissue box looks just like linen - but it's better because unlike real linene, it can be wiped down and cleaned. It is a soft linen color... it blends beautifully into any decor. Such an improvement over a cardboard tissue box. I got one for my bathroom, then ordered one for our bedroom. I just ordered another for the kids bathroom. It has a magnetic bottom which is great and the price is right. I've purchased big clunky ceramic tissue box covers in the past and these are far superior. Understated and very pretty. - Lindsey Tattory",
    "comment 2": "Quality...The box is better than expected! The linen is a type of vinyl with a \"real\" look to it. Easy to clean. The magnet works great and the tissue box fits perfect. - KP",
    "comment 3": "Love this. Tissue box fits in perfect. It is a nice weight. Like the magnet on bottom to keep shut and looks nice on my table - L. A. Earich",
    "comment 4": "Nicer than expected. Holds the tissue box well. Not flimsy, very sturdy. Lovely linen look. Rich gray color. Very happy with this item. - Jmangmaw",
    "comment 5": "These are very attractive without looking too overdone. Nice neutral color for pretty much any decor. This quality material and easy to use. - KatD",
    "Keyword": "tissue box cover",
    "Status": "",
    "Total reviews": "2,895"
}