{
    "Product title": "Small Soap Dispenser for Bathroom and Kitchen, Modern Farmhouse Striped Style Plastic Hand Soap Dish Soap Dispenser with Pump Matte Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0C994176Z?tag=aijento-20",
    "Price": "$6.99",
    "Current Price": "$6..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.4 / 5.0",
    "Total review": "-2,316",
    "Brand": "YAUKPH",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/411VIB8rd1L._AC_SL1000_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/51O9Zr41XwL._AC_SL1000_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/51tT-HmQDlL._AC_SL1000_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61-FEn4XzmL._AC_SL1000_.jpg",
    "Key Features": "Modern Farmhouse Style: Featuring a timeless and sturdy striped anti-slip pattern, this soap dispenser combines it with an ABS rust-proof pump head | Reinforced Hard Plastic: Decorate your bathroom or kitchen without worrying about breakage issues | Perfect Size: With dimensions of 2.7x6.8 inches and a capacity of 8.5 ounces, it takes up less countertop space | MULTI-USE: The soap dispenser can be used for dish soap, hand soap,liquid soap,lotion, shampoo, body wash, mouthwash,massage oils,essential oil and so on,can be placed in any countertop, bathroom, kitchen or office | After-Sales Guarantee: Thank you for choosing YAUKPH. If you encounter any issues with the product, we will reply to your email within 24",
    "ASIN": "B0C994176Z",
    "Affiliate Link:": "https://www.amazon.com/dp/B0C994176Z?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/ecbf4bd2-7405-4f0a-a252-5347985c0f0a/default.jobtemplate.hls.m3u8",
    "comment 1": "It looks very nice, and I'm surprised at the quality! It's heavier than I thought it would be with nothing in it - in a good way, it feels like it won't easily fall over when it's low on soap. It doesn't look like cheap plastic and feels thick, especially the base.We have had no issues with the pump mechanism so far, and I really like how the soap comes out from the bottom, instead of at an angle through the tip, which makes it easier to wipe off & use with one hand. It also puts out a normal amount per pump, not noticeably more or less than others I've used.It's listed as a small dispenser, but when I was filling it, I thought it held a lot of soap, but that's probably just relative.Overall, I recommend! I'm happy with it so far :) - evelyn",
    "comment 2": "I  started using this dispenser (I bought white)  as soon as I opened the package. It is just the right size and is lightweight. It can be easily gripped and lifted to dry underneath it and doesn’t show water stains as it is a high quality plastic.Best of all, the soap is pumped DOWN instead of OUT, so the user knows exactly where the soap is going. - Louise D. Somes",
    "comment 3": "I was expecting this dispenser to be way smaller but it was actually a great size and worked well for what I needed it for. The price it was listed for was great, I would buy more of these, just bought 1 for now since I was scared it was going to be too small. - Alkairy Alkali",
    "comment 4": "It looks cute and doesn’t have that green discoloration that some pumps end up getting. I only wished it had a longer nozzle that reaches the bottom of the dispenser. - Angel G.",
    "comment 5": "Love this! First one I ordered, the pump would not work. Company sent new one next day and I was able to return other for free. This looks amazing on our new bathroom. Feels great as well. I will buy more for sure! - Amazon Customer",
    "Keyword": "soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}