{
    "Product title": "Upgraded Toilet Plunger with Holder, Wall Mounted Toilet Bowl Plunger with Hideaway Caddy, Dual Handle Plunger for Bathroom Built-in Drip Tray, White",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FPC9BQJG?tag=aijento-20",
    "Price": "$17.99",
    "Current Price": "$17..99",
    "Was": "$19.99",
    "Discount": "-10%",
    "Rating": "4.4 / 5.0",
    "Total review": "-328",
    "Brand": "Cinola",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71FXVVzUvaL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71aeZpY3TvL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/81j7KH37hRL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71q45IEXFFL._AC_SL1500_.jpg",
    "Key Features": "DUAL HANDLE DESIGN: The ergonomic grip design allows you to push the plunger downwards more effortlessly, making it easy for children and young women to complete. | WALL MOUNTED TOILET PLUNGER: The toilet plunger with holder comes with a sticky hook, providing two options for your bathroom storage: wall mounted or standing. Hanging the toilet plunger on the wall can prevent water from contaminating the floor and producing odors, keeping the bathroom dry and hygienic. | EASY TO CLEAN: The plunger with holder is made of high elasticity and high-quality materials, which does not need to be folded by hand to reduce odors. The inner wall will not hide hair and paper scraps, and can be rinsed with clean water. | VENTILATION & DRAINAGE SYSTEM: When you lift the toilet bowl plunger, the lid will automatically open, and when you place the plungers for bathroom back on the brush holder, the lid will automatically close. The bottom comes with a pull-out water storage tray, and the compact space saving design hides your bathroom plunger. | 360 DEGREE DEEP CLEANING: The sink plunger adopts a straight tube structure design, where you only need to grip the handle with both hands and apply downward force. The head of the plunger can penetrate the pipeline without getting stuck.",
    "ASIN": "B0FPC9BQJG",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FPC9BQJG?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e045b444-0dde-43c2-9cc1-a7cc41e01b54/default.jobtemplate.hls.m3u8",
    "comment 1": "I had a clogged toilet where I attempted to use a traditional plunger about 67 times. I gave up and bought this one and my clog was cleared with 2 pumps! Works great for toilets but not showers or sinks. The discrete, hands free base works well too. Good value, durable ans easy to wield due to small size and weight. - Uncle Sam",
    "comment 2": "I have such low flow toilet water, this plunger works perfectly and does not get all gross and dirty. Easy to clean a easy to use. - Nikkie",
    "comment 3": "This is perfect to keep the toilet area clean! I love the shape of the brush and it works well. I will buy another one for our downstairs bathroom (which has a silicone wand which doesn’t clean the toilet well). This was a good buy. - LesB",
    "comment 4": "The plunger gets the job done, but it takes a lot of work.  Takes more work than a regular plunger and is easier to handle than a plumber's snake. - Commando Consumer",
    "comment 5": "This product is so lightweight that you might think it can never do the job. I'm 79 years old and I fractured my wrists in 2012 so I have limited strength. I have tried every plunger made without success and this one amazed me. It just took one push and my toliet was unclog. - Nancy R. Gallagher",
    "Keyword": "plunger",
    "Status": "",
    "Total reviews": "2,895"
}