{
    "Product title": "HAMITOR Shower Caddy Tension Pole: 4-Tier Corner Rustproof Bathroom Organizer with Soap Holder & Hooks - No-Drill Adjustable Shower Shelf for Renters - Family Stand Storage Rack - 47-123 Inch Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FLJSYZ9Y?tag=aijento-20",
    "Price": "$37.98",
    "Current Price": "$37..98",
    "Was": "$49.99",
    "Discount": "-24%",
    "Rating": "4.5 / 5.0",
    "Total review": "-338",
    "Brand": "HAMITOR",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/41FvUyP72-L._AC_SY300_SX300_QL70_FMwebp_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/41FvUyP72-L._AC_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/51TwyJ7+d6L._AC_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/41aGvEKH04L._AC_.jpg",
    "Key Features": "NO-TOOLS INSTALLATION IN MINUTES: Shower caddy tension pole design requires no drilling, screws, or permanent alterations. Simply expand the pole between your floor and ceiling for a truly damage-free and secure fit. Ideal for renters and homeowners seeking a sturdy, straightforward storage solution that holds even the largest family-sized bottles with ease | 4-TIER STORAGE FOR THE ENTIRE FAMILY: Corner shower caddy features 4-tier shelves, including 2 extra-tall baskets to store tall conditioner bottles. Easily adjust each tier with the clip to fit any item. Extension hooks and soap dish keep loofahs, razors and brush neatly stored and within easy reach. Create a dedicated spot for every family member's essentials | RUST-RESISTANT SHELVES FOR LASTING BEAUTY: Crafted from rust-proof stainless steel with a protective coating, the shower organizer corner is built to last in humid showers. The wide, vented shelves are designed for quick water drainage, effectively resisting water buildup and easy to wipe clean to maintain a cleaner shower environment and lasting aesthetic appeal | SPACE-SAVING WITH UNSHAKABLE STABILITY: Unlike outward-curving baskets, our corner shower shelf bends inward, fitting snugly into corners to liberate floor space and avoid bumps. This smart design is paired with our spring-tension, which locks the pole securely from floor to ceiling. Get a shower caddy that maximizes capacity in tight spaces with stability | ADJUSTABLE HEIGHT FOR ANY BATHROOM: Effortlessly adjust the tension pole from 47.71\" to 123.6\". Its versatile design maximizes corner space in diverse settings like small bathrooms, apartments, RVs, bathtubs, and shared bathrooms. The standing shower caddy creates a personalized zone for every family member. Note: Not compatible with sloped ceilings",
    "ASIN": "B0FLJSYZ9Y",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FLJSYZ9Y?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0051e59f-a8e3-4bae-80dc-5656868c67fe/default.jobtemplate.hls.m3u8",
    "comment 1": "Very easy to install, seems sturdy once put up and looks great. I like that you can move the shelves where you want. I tried the stick on shelves before this and none worked. These are pretty easy to use. Sizing is great for all of our shower supplies and the added hooks the side is a great way to maximize storage. Would recommend. - Kylee",
    "comment 2": "I purchased this shower caddy about 2 months ago, and it’s been a great fit for our family of four. The two large shelves are perfect for those of us with more shower items, and the smaller shelves have spots to hang loofahs or body scrubbers, which is really convenient.It was easy to assemble and feels very sturdy. So far, we haven’t had any issues with chipping or rusting. Very happy with this purchase feel it was worth the money. - Lisa",
    "comment 3": "This is a sturdy, functional and very nice looking accessory. I was pleasantly surprised at how simple installation was. Also, activating the 24 month warranty online was a breeze. Im very happy with my purchase. I definitely feel like I got my money's worth and more. Im going to buy another for the opposite corner of my shower just to put small plants on. It is a lovely piece! - Trish P",
    "comment 4": "Nicely built and easy assembly. A lot of room! Looks great! Great price! - Shannon Copeland",
    "comment 5": "Nice caddy. Plenty of storage and shelves are good size. Easy to assemble. The fit adjuster is really nice. Creates very sturdy fit. Set up is easy. Shelf adjustment is nice and the shelves stay in place , no sliding down so far. A good value compared to last one I purchased at a big box home store retailer. - Daddio",
    "Keyword": "shower caddy",
    "Status": "",
    "Total reviews": "2,895"
}