{
    "Product title": "OXO Good Grips Stainless Steel Soap Dispenser, Kitchen and Bathroom Accessories",
    "Buy on Amazon": "https://www.amazon.com/dp/B0829N8C9G?tag=aijento-20",
    "Price": "$25.95",
    "Current Price": "$25..95",
    "Was": "",
    "Discount": "",
    "Rating": "4.4 / 5.0",
    "Total review": "-15,268",
    "Brand": "OXO",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61GaZcd6ojL._AC_SL1500_.jpg",
    "Product Image 2": "",
    "Product Image 3": "",
    "Product Image 4": "",
    "Key Features": "Designed for Easy One-Handed Dispensing: This OXO soap dispenser has been designed with busy cooks in mind - so you can clean up efficiently and get to the next part of your recipe knowing your hand soap dispenser is always at your fingertips | Nonslip Base Keeps the Soap Dispenser in Place: Pump soap one-handed without your hand soap dispenser slipping all over the countertop. This dish soap dispenser reliably stays where you need it - at your fingertips | Comfortable, Soft Soap Dispenser Pump: The hand soap pump on this soap dispenser cushions your hands when you pump, and the spout on this kitchen soap dispenser is optimally angled for pumping soap onto a sponge or into your hands or sink | Clear Window Signals It's Time to Refill: The clear window on the base of the kitchen soap dispenser shows you clearly how much soap is left in the soap pump. The wide mouth and MAX fill line make this bathroom soap dispenser easy to fill | Brushed Stainless Steel Construction: This dish soap dispenser for kitchen has been designed with a fingerprint-proof brushed stainless steel construction, which keeps the hand soap dispenser looking sleek",
    "ASIN": "B0829N8C9G",
    "Affiliate Link:": "https://www.amazon.com/dp/B0829N8C9G?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e169b2da-11ba-474b-88d6-27aa454f5f50/default.jobtemplate.hls.m3u8",
    "comment 1": "I initially ordered the foaming version for use with Mrs. Murphy hand doap. Unfortunately, that soap is too thick for that foamer. But these non-foamers work perfectly, stay where they are placed, and look nice. - Mike C.",
    "comment 2": "I have ordered this product multiple times. I make my own foaming soap and this is the best soap dispenser I’ve found! Works well, looks great and has saved me a ton of money. Great value for the price. I’m - Veronica",
    "comment 3": "Thoughtfully designed from top to bottom: the silicone top gives a firm yet comfortable touch, the stainless steel body keeps its clean look even with random water splashes, the little bottom window shows when it’s time to refill, and lastly the grippy base keeps it steady. I use it to hold dish-washing soap, and it intuitively dispenses the amount I need. Refilling is dead simple. Another winner from OXO! - Jason Approved",
    "comment 4": "Update after 10 months: I still love appreciate this dispenser every day, and I consider it one of those little things that just makes life easier... it's silly, but dealing with dish soap is so consistently frustrating. (I don't have a dishwasher so I am hand washing dishes throughout the day.) I did add a second for hand soap a couple of months later, no problems with that either. It would be nice if they came in a smaller size, but that's hardly a complaint. Seriously, if you're looking for a dish soap solution, this is it.--------------------------------I was so fed up with crappy dish soap pumps I REALLY wanted to find something different. There are a million different bottle designs out there, but it seems like they all use the same cheapo pump mechanism -- you know which one I'm talking about. That pump just doesn't work well, and it's guaranteed to fail before too long. So, I was looking for something higher quality and more durable.I was a bit reluctant to try this pump after reading some of the negative reviews, especially since there are no photos of the actual pump. Is it just the same crappy pump under a fancy cap? I don't want to waste $24 on another frustrating pump that's going to be broken inside of a year. But there were precious few alternatives that attracted me, and there were a lot of positive reviews, so I gave this a go.I am so glad I did! I've had this pump for almost 6 months so far, and ergonomically and functionally it is wonderful.* It's very stable on  my porcelain sink. The base is broad enough to keep it from wanting to be tippy, and the rubber ring on the bottom does a great job at keeping it from slipping. The broad, flat button and light touch also contribute to stability in use.* The clear section at the bottom works very well as a sight gauge. I thought I preferred something where I could see how much soap was left in the bottle, but this is surprisingly much nicer because I find it prevents me from obsessing over how full it is and when I should add more soap. That sounds dumb, I know, but I've found it's such a relief not to have to think about it. When it's almost empty I know it, and fill it up. Otherwise, I never, ever think about it. One more thing off my mind.* And, the most important part, the pumping action is perfect! The broad cap makes it really easy to pump with a press of a finger or palm, as opposed to a tiny little button on a long post. The pump stays primed ready to dispense soap, you never have to pump it a few times to draw more soap back up to the top. It's got a very light touch and it's easy to choose how much soap you want: you can dispense a tiny amount with just a light press.* I am able to pick up the bottle and dispense some soap with one hand, using my forefinger to press the button. I saw that some people had questions about that. It's really not designed for that, the bottle isn't the right shape so it's a little awkward feeling, but I've found it easy to do in the few instances I've wanted to do it.* No problems as yet with any leaking or dripping. Oh my gosh, the thing doesn't drip soap from the spout! I hadn't even thought about that until just now. That has been a real annoyance with prior cheap pumps.So, after six months I am still VERY happy with this pump. I really hope it proves to be durable. It feels very high quality, so I have high hopes for its longevity.  I just ordered another for hand soap -- we'll see how that goes! - Malcontent",
    "comment 5": "This was a gift for my mom. She loves it! Easy to fill and economical to use. Heavy enough base that it never tips while using. Slightly rubberized feel to pump top so no slips when pushing down to dispense. Also easy to keep clean, just give it a swipe around the outside and top with a damp dishcloth when doing dishes or something.Took off a star due to the price - I realize it's a name brand and a quality product, but still a little overpriced. Worth it as a gift item, but I'm not certain I would pay as much for something for myself. - TAO",
    "Keyword": "soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}