{
    "Product title": "Automatic Soap Dispenser, Touchless Dish Soap Dispenser 17oz/500ml with Infrared Sensor, 5 Adjustable Soap Levels, Liquid Dispenser for Bathroom Kitchen (Silver)",
    "Buy on Amazon": "https://www.amazon.com/dp/B09NVGSSC2?tag=aijento-20",
    "Price": "$21.98",
    "Current Price": "$21..98",
    "Was": "$28.99",
    "Discount": "-24%",
    "Rating": "4.2 / 5.0",
    "Total review": "-9,964",
    "Brand": "PZOTRUF",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61RMC1SQv5L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71GOhZTgGBL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71RiU4za+ZL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71SJlCw7B0L._AC_SL1500_.jpg",
    "Key Features": "[Automatic Soap Dispenser ] Built-in upgraded infrared sensor, this hand soap dispenser can sense and dispense soap accurately when you place your hands under the sensor within the range of 0-2.36in. Hand or light-colored objects recommended.Hands-free and touchless features effectively avoid cross infection, make your washing more hygienic and safer. No-drip spout of the liquid soap dispenser minimizes clogging and prevents messy drips. | [High Capacity Soap Dispenser] PZOTRUF automatic soap dispenser with a wide opening can hold 17oz/500ml liquid soap, larger capacity than most soap dispensers in the market, and avoid refilling frequently. The transparent visible container allows you to easily see how much volume of liquid has left inside and know when to refill. Compatible with most kinds of liquid. | [5-Level Adjustable Soap Output Volume] Features with 5 different liquid soap dispenser settings, this dish soap dispenser allows you to set your desired volume easily by pressing the “+/-” buttons. Easy to use and quick to dispense. Needless to worry the volume is too little or too much to meet your needs or waste the soap. | [Sleek, Waterproof & Leak-proof Design] Designed with high-quality and shiny non-rust brushed aluminum, this kitchen soap dispenser is attractive and durable, easy to clean. The soap dispenser also comes with leak-proof and IPX4 waterproof technology to prevent soap or water from corroding circuit boards. Non-slip base with a high sealing rubber ring enhances its durability and waterproof performance.If liquid cannot be dispensed, please clean it in time. | [Wide Compatibility Soap Dispenser] This touchless soap dispenser operates on 4 AA Alkaline batteries (not included), which can be used in any occasion without limits on the power outlet. Suitable for multiple occasions, such as home, hotel, school, office, and other places. We will provide 2-year quality assurance and lifetime professional service, please reach out to us if any help is in need.",
    "ASIN": "B09NVGSSC2",
    "Affiliate Link:": "https://www.amazon.com/dp/B09NVGSSC2?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7aaa69fd-30e5-4364-bd7f-c19a7cea13ad/default.jobtemplate.hls.m3u8",
    "comment 1": "This soap dispenser is very responsive and easy to use. The sensor works great, the flow is adjustable, and it looks sleek in the bathroom. Excellent quality and very convenient - Melissa Rodríguez",
    "comment 2": "I bought these to replace the other touchless dispensers that I had.  These are quite a bit cheaper than the others.  Do not require to be plugged in to charge, They are adjustable to the amount of soap they provide and the battery live is very good.  I use the one on my kitchen sink for washing dishes and hands everyday and only had to replace the batteries once.  Has large soap capacity.  Motion detection is good it will recognize a wet dish cloth.  So far it has been more durable this the charging type which 3 of 4 quit working that I paid twice the money for. - Trent Allen",
    "comment 3": "I’ve had this pair of soap dispensers for a year and a half now. They have been great. One of them stopped working about a month ago, but when I contacted the company, they were very polite and responsive via email. They sent me a brand new one within less than a week. Given that I’ve had other soap dispensers that broke within six months, and when you contacted other companies, they ignore you or have already been removed/left Amazon. Thus, overall, I would recommend this soap dispenser, and company to others : ) - Brian Provance",
    "comment 4": "I’ve always had pump soap dispensers everywhere.  I decided to try an automatic dispenser out of curiosity.  I really like not touching the dispenser every time I wash my hands.  This is an economical choice that is battery operated.  I use a generic liquid soap that is diluted with water in the canister so that it flows easier.  It has a less wasteful squirt and works pretty well.  Not all squirts are equal. It requires 4 AA batteries.  I definitely prefer this dispenser to pumps for cleanliness reasons.  However, I would probably need to upgrade for the dispenser to be more substantial.  That said I’m glad I bought it and I’m sticking with it as long as it lasts.  The batteries seem to last a reasonable amount of time.  The kitchen dispenser has been the first to require replacement batteries after several months. Bedroom bathroom continues to perform. - Truthsayer",
    "comment 5": "We LOVE this automatic liquid soap dispenser!!!  It works as advertised. We've placed it with the front edge of the base even with the edge of the sink. Any extra drips and drops go into the sink rather than on the counter.  We wash our hands pretty frequently, and this dispenser also helps us cut down on waste of liquid soap. The main erason we purchased is to cut down on the drippy small soap squirty bottle mess on the counter.  It definitely does that quite well.  The refill hole in the top of the unit is large, so it is SO much easier to reload from the giant bulk bottle of liquid soap of our choice.  That's another big plus!  The exterior is shiny, slick chrome plastic, so if you should get some soap or other stuff on it, it will wipe or rinse off easily.  Love this dispenser and highly recommend.  This took care of something that has annoyed me daily for three years at a very reasonable price.NOTE:It is a bit bulky, so measure the spot you tend to place it in. This is in our master bath with a double sink and long counter, so space wasn't an issue.  It needs a flat spot to sit on to work effectively. - Rhoda and the Sloth",
    "Keyword": "soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}