{
    "Product title": "Self Draining Soap Dishes, 3 Pcs Silicone Soap Saver, Waterfall Drainer Soap Holder for Bathroom, Extend Soap Life, Keep Soap Bars Dry Clean & Easy Cleaning (White, Gray, Teal)",
    "Buy on Amazon": "https://www.amazon.com/dp/B09CGYN74K?tag=aijento-20",
    "Price": "$4.99",
    "Current Price": "$4..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-8,137",
    "Brand": "MODENGKONGJIAN",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61t1spxFZ9L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61rqVWMDXHL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61gj09CHdDL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61JPp62XweL._AC_SL1500_.jpg",
    "Key Features": "【SOFT & PRACTICAL】Soap dish is made of high quality flexible silicone, easy to clean, beautiful, and very practical. | 【ANTI-SLIP, NO WATER ACCUMULATION】Soap savers are designed with grooves to prevent soap from falling down. Self-draining levels allow water to flow out, Keep soap dry quickly, so that it prevents soap melting and extend soap life. | 【WIDELY USED】These soap trays mainly used at home for shower, bath tub, kitchen sponges, cleaning ball, shaver, shampoo, shower gel, hair Clips, earrings, and other small items. They work great in the shower/ bathtub/ kitchen/ countertop and more. | 【BUY WITH CONFIDENCE】The soap rack is made of high-quality environmental protection silica gel. soft and it almost no smell, adults and children can use it safely, You will never worry that it will break or hurt other items. | 【WHAT YOU GET】You will get 3 pieces soap holder totally in one package, enough quantity for your own use and share them with your families, friends.",
    "ASIN": "B09CGYN74K",
    "Affiliate Link:": "https://www.amazon.com/dp/B09CGYN74K?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/e5287682-30cd-4c63-9d8c-ea67958e748b/default.jobtemplate.hls.m3u8",
    "comment 1": "These soap dishes work really well! The water drains away nicely, so the soap doesn’t get soft or melt. Easy to clean, sturdy, and the colors look great in the bathroom. Very happy with this purchase! - Raushan Ospanaliyeva",
    "comment 2": "The soap dishes work really well and the bars last longer because they dry quickly. The dishes are easy to clean and look nice. - Jill",
    "comment 3": "Nice, simple, easy to clean, does the job - Kindle Customer",
    "comment 4": "I love how these look and it came with three different colors. I put one in each bathroom and I was very happy that the soap did not drip off. The size is perfect very easy to use. The stickiness is gone and my showers and I couldn't be more happier. - Kendra Connelly-little",
    "comment 5": "Good value, functional soap dishes for bar soap. Allows the water to drain into the sink. Easy to clean. Fingers fit right into the groves for super easy cleaning of any soap buildup. - Janice L.",
    "Keyword": "soap dish",
    "Status": "",
    "Total reviews": "2,895"
}