{
    "Product title": "Clara Clark Bathroom Accessories Set - Bathroom Set, Bathroom Accessory Set, Shower Curtain Set, Toilet Brush, Trash Can & Soap Dispenser - Purple - 20PC",
    "Buy on Amazon": "https://www.amazon.com/dp/B0CT94VCS9?tag=aijento-20",
    "Price": "$32.99",
    "Current Price": "$32..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-2,075",
    "Brand": "Clara Clark",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71GqIG5qFqL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71tW3sf92ZL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71wsvZnzrHL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71xC5qop2LL._AC_SL1500_.jpg",
    "Key Features": "100% Polyester | Purple Bathroom Accessories Set: Incorporate Purple bathroom decor with our coordinated bathroom accessory set for bathroom organization. Our Purple bathroom set with natural bamboo accents create a stylish haven. | Complete Bathroom Set: Toothbrush holder, tumbler, soap dispenser, soap dish, bathroom trash can, toilet brush and holder set, and fabric shower curtain set with clear shower curtain liner and 12 shower curtain hooks. | Purple Shower Curtain: Our shower curtains for bathroom measure 72” x 72” and are made of durable, wrinkle-resistant polyester with a waffle texture, and include reinforced header and hook holes. | Boho Shower Curtain with Shower Liner: This shower curtain with hooks includes a clear shower curtain liner with weighted magnets at the bottom to keep it in place, and 12 rust-resistant shower curtain rings.",
    "ASIN": "B0CT94VCS9",
    "Affiliate Link:": "https://www.amazon.com/dp/B0CT94VCS9?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/a4657a09-4fff-4410-9d3a-c3fd1b15c17d.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f2587b7-53ea-466e-b74a-ae389e8aa6b8/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f2587b7-53ea-466e-b74a-ae389e8aa6b8/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "Exactly as expected. Looks nicer n person. I don't like the curtain liner but that's an easy fix. Decent quality, possibly better than what I paid for it. Pretty deep color too! - Kate",
    "comment 2": "After 6+ months of use, this set has exceeded my expectations. The bright blue remains vibrant ( no fading) , quality is surprisingly solid for the price point, easy to wash and clean. Fits perfectly my small area and easy to organise. This has completely transformed my bathroom. One of the purchases that genuinely made me happy - Srish",
    "comment 3": "Two reasons why I bought this set was the shower curtain because I liked the doted print looked really nice and the toilet brush it will be very useful, and the price was not too bad either. - Big Don",
    "comment 4": "We recently moved into a new home, and I wanted to give my teenager's bathroom a fresh, cohesive look. The Clara Clark Bathroom Accessories Set in green caught my eye, and it turned out to be a fantastic choice.​The set includes everything we needed: a shower curtain with liner, bath mats, a toothbrush holder, soap dispenser, soap dish, trash can, toilet brush with holder, and even matching hooks. The green color is modern and richl, fitting seamlessly with the bathroom's decor.​The shower curtain is made of durable polyester with a waffle texture, and the included liner has weighted magnets to keep it in place. The bath mats are plush and absorbent, with non-slip backing that ensures safety.​All the accessories feel sturdy and well-made. The soap dispenser and toothbrush holder have a sleek design, and the trash can and toilet brush holder are compact yet functional.​My teenager loves the new setup, and the bathroom now feels more organized and stylish. This set made it easy to achieve a coordinated look without the hassle of buying individual pieces.​ - Julie Marie",
    "comment 5": "The slip resistance is pretty good overall. The pieces stay in place on the counter and don’t slide around easily during everyday use. They feel sturdy and well made, and the set looks very clean and modern in the bathroom.On very smooth or wet surfaces, there can be a little movement, but nothing major. For normal bathroom use, it does the job well and adds a nice, cohesive look to the space. - Shénet S. Callwood",
    "Keyword": "bathroom set",
    "Status": "",
    "Total reviews": "2,895"
}