{
    "Product title": "UUJOLY Foaming Soap Dispenser, 450ml (15oz) Refillable Pump Bottle Plastic for Liquid Soap, Shampoo, Body Wash (2 Pcs) (Amber)",
    "Buy on Amazon": "https://www.amazon.com/dp/B07Y8543WQ?tag=aijento-20",
    "Price": "$8.99",
    "Current Price": "$8..99",
    "Was": "$9.99",
    "Discount": "-10%",
    "Rating": "4.2 / 5.0",
    "Total review": "-9,092",
    "Brand": "UUJOLY",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/51PRRpQdLDL._AC_SL1000_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/51+CNPWfZlL._AC_SL1001_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/51cbTyG12QL._AC_SL1000_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61mdn1SS6VL._AC_SL1000_.jpg",
    "Key Features": "Save soap: This plastic foaming soap dispenser can reduce the amount of soap. Add water in a ratio of 1:3~5 to produce a rich foam that will allow your soap to be recycled better. | Safety material: Made of high-quality PETG material, not easy to break, and the long-lasting plastic pump head can be reused. | Multi-uses: Liquid bottle can be placed in the fillable bathroom kitchen laundry room for soap, shower gel, shampoo. Hand soap, etc. | Large capacity: 2.64\" x 2.64\" x 7.48\"inch (67x67x190mm), can hold 15 oz of foam soap solution. | Design: There is a plastic safety buckle between the top of the pump and the top of the plastic screw for fixing, you can remove it, the plunger on the pump moves freely.",
    "ASIN": "B07Y8543WQ",
    "Affiliate Link:": "https://www.amazon.com/dp/B07Y8543WQ?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/abef0141-e7e5-4c9e-b4d1-8ca16c4030b7/default.jobtemplate.hls.m3u8",
    "comment 1": "I’ve used these for a month now and they work great.  The large capacity lets you go longer before refilling.  Looks good on my counters. - Pat",
    "comment 2": "These were inexpensive and they suit my needs perfectly. I wanted to start using foaming hand soap at all my sinks in the house. I recharge the foaming soap pumps from a bulk container of Castile soap and water. These work great.These are lightweight, but they’re sturdy enough to stand up to teenage boys. There’s nothing fancy about them, but they’re unobtrusive enough to be nice by the sink. It’s nice to find a product that is affordable and suits my needs. - Sunflower Grl",
    "comment 3": "Work great! Pump movement is smooth and makes a great foam of soap. Would buy again. - Janet Carlow",
    "comment 4": "Very cute looking but the pumps could be better - Jessica Meyer",
    "comment 5": "I tested both immediately upon purchase to make sure they worked so I could return if not. Worked great with the test batch of soap - nice thick foam that came out well on both bottles. I put them away planning to use one for hand soap after the dispenser I was using ran out and planning to use the other for body wash. When I mixed the body wash and water in the one, it didn't create foam at all. It just squirt out a very slightly sudsy but very watery mess that then wouldn't suds up on my pouf. I fought with this for weeks and then finally switched to the other bottle with the same result. I then made a mix of the handwash that I'd tested originally, and neither one would create the nice foam. Instead it was a drippy mess. Aside from the test run, the pump doesn't work well on either one to push through the mixture to create a lovely foam. Instead it hangs up on both bottles, though one is worse, and gives just a drippy sudsy water. Stay away from this cheap China crap. - winteroses",
    "Keyword": "foaming soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}