{
    "Product title": "Artiwell Universal Tip Toe Bath Drain Stopper and Cover, Bathtub Drain Stopper, Replaces Lift and Turn, Tip-Toe and Trip Lever drains for Tub, EZ Installation and Clearing (Chrome Plated)",
    "Buy on Amazon": "https://www.amazon.com/dp/B09VXDYL11?tag=aijento-20",
    "Price": "$10.39",
    "Current Price": "$10..39",
    "Was": "$17.88",
    "Discount": "-42%",
    "Rating": "4.6 / 5.0",
    "Total review": "-4,556",
    "Brand": "Artiwell",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71Nl49jNmbL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81X1pjcKr4L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61sV2AUVNBL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71Jyt6DPPhL._AC_SL1500_.jpg",
    "Key Features": "UGRADED TUB DRAIN STOPPER AND COVER: New design for easy installation and removing, so that you can clearing the hair and tangled messes easily. | COMPATIBILITY: Artiwell Universal Tough-Toe Bath Drain Stopper and Cover have been tested by the plumber, which can be replaced 99% lift and turn, Tip Toe and trip lever Bathtub drains, Includes 2 types of o-rings for you to choose from to fit your existing 1-3/8” or 1-1/2” tub drains. | EASY INSTALLATION: Installation easily without removing the old drain, so install Artiwell Universal Lift and Turn Bath Drain Stopper and Cover, you need’t professional plumber tools , plumber putty or plumber provide the support , you can save some costs. | EASY DÉCOR FOR YOUR BATHROOM: Completely covers your existing Drain without sacrificing style, Provide various colors for you to choose from to Match the color of your existing spout and face plated. | HIGH QUALITY MATERIAL: Artiwell Updated Universal Lift and Turn Tough-Toe Bath tub Drain Stopper and cover coming with High Quality Solid Brass and tarnish-free finish , provides strength and reliable use.",
    "ASIN": "B09VXDYL11",
    "Affiliate Link:": "https://www.amazon.com/dp/B09VXDYL11?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/33425252-fe45-4ff1-89ac-985d51de3da6/default.jobtemplate.hls.m3u8",
    "comment 1": "So easy to install. It looks great and is well made. I had to change out to the smaller white washer that's included to fit my tub. It works perfectly. So happy with this order. - Placeholder",
    "comment 2": "Very nice looking and an easy update to our older tub.  And really does catch hair, does not leak during a tub soak and stays in place.  It’s a winner for sure - Susan B.",
    "comment 3": "Super elegant and makes every difference in bathtub. Fits right in. - Karinna",
    "comment 4": "I'm mostly impressed with this item.  Fits great and easy to install and looks good.  However there is one thing I am not crazy about.  There is basically no filter in place to stop hairs from going down drain.  The openings on this are basically the same as if you left the drain open...should be some kind of mesh screen or something to catch hairs.  Will have to find a gerri rig something on my own.  But other than that a very nice find. - Art B.",
    "comment 5": "",
    "Keyword": "tub stopper",
    "Status": "",
    "Total reviews": "2,895"
}