{
    "Product title": "ChooChoo Bathroom Wall Cabinet, Over The Toilet Space Saver Storage Cabinet, Medicine Cabinet with 2 Door and Adjustable Shelves, Cupboard, Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B091C81D74?tag=aijento-20",
    "Price": "$64.97",
    "Current Price": "$64..97",
    "Was": "$89.99",
    "Discount": "-28%",
    "Rating": "4.5 / 5.0",
    "Total review": "-5,191",
    "Brand": "ChooChoo",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61OnC0vC1RL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81L5ismPJVL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61F62I2ZjPL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61Pc9JPsLJL._AC_SL1500_.jpg",
    "Key Features": "【VERSATILE STORAGE SPACE】24’’H x 21.1’’W x 8.8”D bathroom medicine cabinet with 2 adjustable shelves, offering customizable storage behind 2 doors | 【STURDY】Made up from low-emission P2 grade MDF board and water-based paint, the bathroom cabinet wall mounted is a sturdy wall hanging storage solution ensuring long-lasting reliability | 【MODERN AND ELEGANT DESIGN】Classic black finish adds elegance to your decor, complemented by sleek lines for a clean, decent appearance. This black wall cabinet will make updating your bathroom a breeze | 【GUIDE FOR ASSEMBLY】Detailed instructions will guide the assembly step by step; all parts and accessories of this black bathroom wall cabinet are numbered and easy to distinguish | 【After-Sales】Any question please contact us.We stand behind the quality of our medicine cabinet black wood with excellent customer care",
    "ASIN": "B091C81D74",
    "Affiliate Link:": "https://www.amazon.com/dp/B091C81D74?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30bf6dea-ae2b-46e2-a950-315c9719b783/default.jobtemplate.hls.m3u8",
    "comment 1": "Sturdy and great looking medicine cabinet.  We just repainted and updated our bathroom and looks great.  Easy to install.  Nice and roomy! - k wid",
    "comment 2": "Attractive and highly functional Bathroom Wall Cabinet.  Assembly is easy with excellent instructions.Plenty of room with two adjustable shelves and solid construction.While I am extremely pleased with this purchase, there are two caveats that people should be aware of prior to assembly and mounting.1. This unit is somewhat heavy by itself, and even more so when stocked with various toiletries etc..Mounting on Drywall with the included drywall inserts, and not on a stud, may be a bit lacking in effective support for the weight.As you can see in my pictures, I have used much more robust drywall anchors at the top two holes, and a washer to effectively secure the cabinet to the wall.Additionally, I added to more attaching points to the bottom of the cabinet with normal drywall anchors for additional lateral and vertical stability. This should make the cabinet totally secure, despite any weight added.2. The door hinges are NOT adjustable, so there is likely going to be a slight difference in the height and fit of the two doors which cannot be mitigated. Fortunately, the magnetic door stop does work effectively.Overall, I like the cabinet and with the modifications I added to mitigate any potential problems, this should be secure and last indefinitely. I rate it as barely FIVE STARS and am pleased with my purchase.Recommended without hesitation! - Frank E. Trinkle",
    "comment 3": "Would give it five stars but it’s not top top quality however absolutely a great value. Easy to assemble, easy to install, does the job. Deep enough to hold large cafe style coffee mugs. Great adjustable shelves. - Ron Biancosino",
    "comment 4": "The cabinet is absolutely lovely!  It was delivered on time and came very well packaged.  No damage to any parts at all, nor any scuff marks to be seen.The individual pieces were well labeled which made assembly much easier. The instructions were easy to follow and I was able to assemble it with only one snafu which was my fault and not the vendors.  Each step-by-step assembly instruction included drawings of each screw, bolt, dowel, etc, needed for that particular step, as well as how many of each item you would need.  Holes were all drilled in the right place which was great, too. For this mechanically challenged grandma, those specific instructions were exactly what I needed.  Furniture assembly, even on a small scale, is not something I am good at.The snafu mentioned above meant that I needed a replacement part (cam lock), so I reached out to the vendor for help.  They were very quick to respond and said I could likely find the needed part at my local hardware store, or they would be happy to send me a replacment.  Awesome customer service!  (They were right, I was able to find the part locally).Five solid stars for the customer service and for a surprisingly easy to put together cabinet that looks great! - ellen marie",
    "comment 5": "I’m really impressed with this cabinet! It was surprisingly easy to put together—the instructions were clear and all the parts fit perfectly.Hanging it was a breeze as well; it feels very secure on the wall. It fits perfectly over our towel rack and provides a nice amount of extra storage without looking bulky. The white finish looks clean and modern in our bathroom. Highly recommend! - Package Cam",
    "Keyword": "medicine cabinets",
    "Status": "",
    "Total reviews": "2,895"
}