{
    "Product title": "Ginger Lily Farms Foaming Soap Dispenser, Refillable Plastic Pump Bottles for Liquid Hand Soap, 15 oz. Clear Bottle with White Pump, 2-Pack",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FWT9ZP2K?tag=aijento-20",
    "Price": "$6.99",
    "Current Price": "$6..99",
    "Was": "$3.50",
    "Discount": "",
    "Rating": "4.4 / 5.0",
    "Total review": "-142",
    "Brand": "Ginger Lily Farms",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61-qlyh3cHL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/51TWZHdTVkL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61OuIYr9vuL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61W1PGNq0uL._AC_SL1500_.jpg",
    "Key Features": "Foaming Hand Soap Dispensers: Specially designed for dispensing foaming hand soap, each refillable bottle holds 15 oz of liquid soap and features a clear design for easy monitoring of soap levels. | BPA Free Plastic Bottles: Crafted without harmful chemicals, these refillable bottles are a safe and non-toxic option for you and the environment. | Eco-Friendly Design: Refilling soap containers help reduce single-use plastic waste and promote sustainability. | Durable & Reusable: The sturdy pump dispenser is built to last, offering long-term use while minimizing waste. | Value Pack: Includes two 15 oz bottles, perfect for refilling and keeping your home or office stocked with eco-conscious hand soap dispensers.",
    "ASIN": "B0FWT9ZP2K",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FWT9ZP2K?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/e0fc68a9-1e60-4a4c-9a05-89e9dfd12426.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57846f24-fe97-4fc6-a7af-2393fd681cd3/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/57846f24-fe97-4fc6-a7af-2393fd681cd3/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "Works great with even thick hand soap.  And, the bottle stands up to hard water!  Great price, too! - Ida",
    "comment 2": "These are definitely worth the money. We were looking for a reliable, easy to use, foam soap dispenser that our kiddos (4, 2) can use but not risk breaking. This works very well and meets all of our needs! - Sean Conway",
    "comment 3": "Just what I was looking for. Great function at a good price - Jerry Burns",
    "comment 4": "I like this company because their soap products are high quality and without too many additives, especially SLS.The dispensers work well, no issues so far. I bought them for both the home and office. Buying all those individual, disposable hand soap bottles constantly like I used to got on my nerves and this solved the problem. - G. Stogel",
    "comment 5": "I filled them with 1/3 Castile soap and 2/3 filtered water.  The foam is great for washing hands. The containers are crystal clear and large enough to last a long time. I bought a second pair. - D C",
    "Keyword": "foaming soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}