{
    "Product title": "AIZESI 2pcs Spring Tension Rods Adjustable 26 to 39 inch Small Tension Curtain Rod No Drilling Expandable Spring Loaded Curtain Rod,Suitable for Doors and Windows 28 to 36 inch, White",
    "Buy on Amazon": "https://www.amazon.com/dp/B09P53L5LF?tag=aijento-20",
    "Price": "$13.99",
    "Current Price": "$13..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.4 / 5.0",
    "Total review": "-6,554",
    "Brand": "AIZESI",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/51w2h6Xw5rL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61viwK5XJaL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71QMsZRic8L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/814Pu5rjuoL._AC_SL1500_.jpg",
    "Key Features": "【PACKING SPECIFICATIONS】: 2 pcs of white curtain rods, which can be extended from 26 to 39 inch, and the best use range is 28 to 36 inch，Scalable without drilling. | 【HIGH-QUALITY MATERIAL】:The tension rod itself is made of high-quality inner and outer tube diameter 13/16MM carbon steel, sturdy and durable, and the exterior is made of baking white paint, exquisite and beautiful. | 【STURDY ANTI-SKID】:Both ends of the tension curtain rod adopt pvc anti-skid design, which has stronger anti-skid performance. You don't have to worry about it slipping or falling. Please pay attention to use it within the best use range. | 【WIDE USE】:This spring tension rod can be extended from 26 to 39 inch, the best use range is 28 to 36 inch, suitable for 28 to 36 inch of kitchen windows, bathroom corridors doors, curtains, doorways, portable conditioner, window,washing machines and drying Machine. | 【EASY INSTALLATION】:It is simple and convenient to use, it can be stretched to the length you want to use by just rotating it gently. Note that this product is a splicing type. Two rods with anti-skid pads at one end are spliced together and can be rotated for use. If you have any questions about the product, please consult our customer service team, we will serve you online 24 hours a day.",
    "ASIN": "B09P53L5LF",
    "Affiliate Link:": "https://www.amazon.com/dp/B09P53L5LF?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/192d671a-daa0-47a9-9120-1e857c1850a2/default.vertical.jobtemplate.hls.m3u8",
    "comment 1": "Perfect for hanging garland in my doorway! It’s strong enough to hold the garland plus battery pack which required 3 AA batteries. I like how super easy it is to assemble. I did use the adhesive things that came with it for extra stability because I felt like if I didn’t use them then perhaps overtime the rod may adjust itself or fall because of the heaviness of the battery pack. All in all it is worth it for the price and does its job. - Daniela",
    "comment 2": "The quality is good. The rods are sturdy. They have great tension! My curtains are small, but the tension is so good I feel like they could hold heavier curtains. - Amazon Customer",
    "comment 3": "Works good, need some more adhesive tension rod retainer. I looked to see if sold separately. Please in need other than that, there 💯 - Donna J.",
    "comment 4": "Works well for our windows. Holding up a light curtain. - Laurel Kim",
    "comment 5": "This was perfect for a sheer curtain under blackout drapes. Weight is perfect for this. This is the 3rd spring tension rod I’ve purchased and by far the easiest to install. I purchased white and it works well with decor. Length is perfect for inside my window frame. Holds well. - Pat M.",
    "Keyword": "tension curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}