{
    "Product title": "2PACK Shower Squeegee for Glass Doors, Squeegee for Shower Glass，All-Purpose Tile Walls, Bathroom, Window, Glass and Car Windshield, Mirrors and Kitchen-Stainless Steel, 10 Inches, Silver",
    "Buy on Amazon": "https://www.amazon.com/dp/B0DK3C5DGP?tag=aijento-20",
    "Price": "$9.99",
    "Current Price": "$9..99",
    "Was": "$14.99",
    "Discount": "-33%",
    "Rating": "4.5 / 5.0",
    "Total review": "-3,140",
    "Brand": "ALFLOD",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/613pi8YTwLL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81HvfGdRa+L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71y1P0lZHSL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/7107Obf8rWL._AC_SL1500_.jpg",
    "Key Features": "1. 【All-Purpose Squeegee】This squeegee is versatile cleaning tool for indoor and outdoor use. Easily clean shower doors, windows, tile,mirrors, Bath Sets, kitchen, car windows, decks, patios and other smooth and flat surfaces, Suitable for indoor and outdoor. Our product is 10 inches in size. Suitable for daily cleaning. Please purchase as needed. Buyers are advised to choose our product according to their own usage habits | 2. 【Soft Squeegee】This squeegee with a soft rubber blade. Easily removes water droplets, soap residue and other buildup from bathroom glass door cleaners and other surfaces with your favorite household cleaner to reveal surfaces that shine | 3. 【Ergonomic Handle】An ergonomic design and a lightweight handle.Giving a comfort, effortless grip and superior control during cleaning. When using, please attach it to a smooth contact surface and apply gentle force. Excessive force may cause uneven stress on the wall, resulting in marks | 4. 【Sturdy and Long-lasting 】Suring a long-lasting,rust and corrosion free performance in various environments. Sturdy and Long-lasting as an often-used home essential for daily cleaning | 5. 【Easy To Store &Use】Comes with waterproof adhesive hooks which can be attached to any smooth surface, you can hang the squeegee on the shower walls, kitchen and any other places for easy storage and quick accessibility. Please purchase our product based on the area of your bathroom; otherwise, it may not fit properly during use",
    "ASIN": "B0DK3C5DGP",
    "Affiliate Link:": "https://www.amazon.com/dp/B0DK3C5DGP?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/8a9465b8-5119-4353-9c00-a26d5d855a38/default.jobtemplate.hls.m3u8",
    "comment 1": "This tool is very easy to use. And it was easy to hang on the shower and it cleans the sides of the walls as well as the doors. I really like it does a great job. And it keeps the bathroom looking clean.Doesn't have romantic streaks. There's a few that I've caught, but I've been able to go back over it and get it done, and it does good. And it does a great job with scraping down the water, so I'm not going to complain.Very lightweight, and it's not hard to hang on to the handle.Is perfect - Happy",
    "comment 2": "This is a wonderful price and product! I'm just be careful when you are pushing really hard on the top, side, and really and straight edge! It *will* cut your finger like a bad paper cut! LOL just a fyi, and it is definitely something I watched out for on the second one! However, they are both there to stay. . . So, excellent product quality and helpful to keep even showers that don't have glass clean because if you squeegee the wall and tub sides (mirror too if you want to use it faster even with a good vent) it will keep it cleaner and dry everything out faster!This means dryer bathroom, less mold/mildew chances, less time running a vent that may not be the best anyway? Etc... - AHAdarlings",
    "comment 3": "These shower squeegees do exactly what they’re supposed to do. They glide smoothly across glass and tile and remove water without leaving streaks behind. Using them regularly has definitely helped keep water spots and soap residue from building up on my shower doors.The handles feel comfortable and lightweight, and the blades are flexible enough to contour to the surface. I like that this is a two-pack, which makes it easy to keep one in the shower and use the other for mirrors or windows. The only minor downside is that they’re fairly basic in design.Overall, these are solid, no-frills squeegees that work well and are a good value. I’m giving four stars because they’re effective and convenient, even if they’re nothing fancy. - fred",
    "comment 4": "Nice shower squeegee.  It works really well and leaves everything looking good.  Durability is good.  Water removal is really good. - Zjones",
    "comment 5": "They do a great job on my doors, feel like great quality when cleaning the glass , very smooth! - Patti",
    "Keyword": "squeegee",
    "Status": "",
    "Total reviews": "2,895"
}