{
    "Product title": "Toilet Cleaner Brush, Silicone Toilet Brush+Pumice Stone for Toilet Cleaning, with Non-Slip Long Handle, Wall Mounted/Floor Standing, Toilet Brush Set for Bathroom RVs",
    "Buy on Amazon": "https://www.amazon.com/dp/B0G25FGB4Y?tag=aijento-20",
    "Price": "$15.99",
    "Current Price": "$15..99",
    "Was": "$0.62",
    "Discount": "",
    "Rating": "5.0 / 5.0",
    "Total review": "-2",
    "Brand": "Brand: QuiVix",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61zbDleuNgL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61DU4RosJ4L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/7184vwuW8aL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61+4205brLL._AC_SL1500_.jpg",
    "Key Features": "【2-in-1 Toilet Cleaning System】Includes 1 toilet bowl brush, 1 pumice stone for toilet and 1 base. The toilet brush cleans deep under the rim, while the pumice stone quickly removes tough stains, limescale, and hard water stains. Ideal for both routine maintenance or deep cleaning, keeps your toilet sparkling. | 【Silicone Toilet Brush】The toilet brush head is made of soft silicone material, can be used on all toilet types. No more hair tangles or stubborn residue—rinse clean in one go. Say goodbye to scratched toilet glaze caused by rigid brushes: our silicone design is gentle,glaze-safe, and no scratches left. | 【Natural Pumice Stone Stick】Ideal for eliminating tough limescale and urine stains on toilet bowls.Before use, thoroughly wet both the pumice stone and the stained area with clean water.Note: For ceramic toilets only — never use on soft surfaces like acrylic or plastic！As consumables, pumice stone for toilet will naturally wear down with friction during use. Replace promptly when signs of excessive wear appear. | 【Ventilated & Stable Base】Ours toilet brush features a stable base that seamlessly integrates into your bathroom environment. Its well-ventilated design keeps the silicone toilet brush quickly dry and odor-free. The built-in drip tray at the bottom prevents water from dripping onto the floor. | 【Easy to Install】The toilet bowl cleaner brush is detachable and easy to install, featuring a hanging hole at the top for independent wall mounting. Space-saving—the toilet brush and holder can be wall-mounted with adhesive stickers or used as a freestanding toilet brush and holder set placed on the floor.",
    "ASIN": "B0G25FGB4Y",
    "Affiliate Link:": "https://www.amazon.com/dp/B0G25FGB4Y?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f8e52f6f-d09b-4210-90c2-499284a4b2bc/default.jobtemplate.hls.m3u8",
    "comment 1": "Brilliant design and cleaning power. I’ve come accustomed to using the single use throw away scrub pads but noticed they were only doing half the work necessary. The silicone brush is unique and it cleans really well. It was easy to get the trouble areas (under the lip of the bowl) without having to scrub too long. The caddy/holder keeps nasty toilet water from getting all over the floor, so I don’t mind this one staying next to the toilet.i haven’t had to use the pumice stone yet, but comparing it to my others around the house, this one seems just as good. I love that I have the option to attach it to the wand too. This is a very good scrubber and a great value! - Crystal R",
    "comment 2": "This toilet brush set is very effective and well designed for regular bathroom cleaning. The silicone brush cleans thoroughly without scratching and is easy to rinse clean after use. The long, non slip handle makes it comfortable to use and keeps hands away from the bowl.The included pumice stone is a great addition for tackling tougher stains when needed. I also like that the holder can be wall mounted or floor standing, which helps keep the bathroom organized. Overall, this is a practical and versatile toilet cleaning set that works well. - An Diep",
    "comment 3": "",
    "comment 4": "",
    "comment 5": "",
    "Keyword": "toilet brush and plunger set",
    "Status": "",
    "Total reviews": "2,895"
}