{
    "Product title": "PINXIURY Water Hyacinth Handwoven Tissue Box Cover, Natural Handmade Wicker Napkin Box Holder, Handcrafted Square Facial Tissue, Rustic Decorative on Table and Bathroom, Office, Boho Decorative",
    "Buy on Amazon": "https://www.amazon.com/dp/B0D73FJ14L?tag=aijento-20",
    "Price": "$12.99",
    "Current Price": "$12..99",
    "Was": "$13.85",
    "Discount": "-6%",
    "Rating": "4.8 / 5.0",
    "Total review": "-575",
    "Brand": "PINXIURY",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71Gcl1y-k8L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/711U99qt4gL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71QsRAxBQOL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71m1sZdrJgL._AC_SL1500_.jpg",
    "Key Features": "Perfect Dimensions: This tissue box cover measures 5.9\"L x 5.9\"W x 5.9\"H, making it ideal for 4.5\"L x 4.5\"W x 5\"H Kleenex tissue boxes, ensuring a perfect fit for standard tissue sizes. | Versatile Functionality: This square tissue box cover is not only a holder for tissues but also serves as an attractive display and storage solution for paper towels and napkins. Elevate your kitchen countertop, side table, or dining area with this stylish organizer. | Artisan Craftsmanship: Each tissue box holder is meticulously handcrafted by artisans with over a decade of experience. Woven from high-quality water hyacinth, it showcases exquisite craftsmanship and adds a touch of nature to your home decor. | Natural Materials: Our refillable wicker tissue holder is crafted from 100% natural water hyacinth, ensuring safety and durability for years of reliable use. It makes an ideal gift on special occasions such as Christmas, Thanksgiving, birthdays, housewarmings, and weddings | Effortless Maintenance: The open design of this tissue box holder allows for easy access to napkins, and cleaning is a breeze – simply wipe it with a damp cloth. Store it in a cool, dry place to ensure its longevity.",
    "ASIN": "B0D73FJ14L",
    "Affiliate Link:": "https://www.amazon.com/dp/B0D73FJ14L?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d0479a6f-d3c3-411b-b9ed-90b9a9486eae/default.jobtemplate.hls.m3u8",
    "comment 1": "I absolutely love this tissue box holder! The woven design looks high-end and adds the perfect warm, natural touch to my powder room. It instantly made the space look more put-together and elevated — like something you’d see in a boutique hotel or home decor magazine.The quality is excellent. It feels sturdy, well-made, and holds the tissue box securely without slipping or collapsing. I also love how the opening is just the right size so tissues pull out smoothly without bunching or tearing.It blends beautifully with my countertop decor and adds a cozy, spa-like vibe to the room. I’ve already had guests compliment it because it looks so chic and unique compared to plain plastic tissue boxes.Highly recommend if you want something functional that also looks beautiful on your bathroom counter! - Warryn Lim",
    "comment 2": "Such a great little tissue box cover. I bought this to use in my office. It’s very well made and fits into my office decor well. It is really good quality for the price and I would definitely buy even if it was a little more expensive. The weave on this is good and not loose at all, so I’m not worried about it falling apart later. The elastic on the bottom keeps the tissue box in place which I found to be an added bonus. Absolutely beautiful. - Dawn P.",
    "comment 3": "Pretty kleexed cover! Im a huger allergy sufferer and I was tired of the ugly kleenex boxes so this definitely added some aesthetics and fashion to my trusty box thats always with me. Good quality and good value for the money. The bottom has a band that keeps the box inside too. - Gianna",
    "comment 4": "Adorable tissue box cover. Fits the tissue box perfectly and provides a nice touch to the guest bathroom. Color and quality are just as advertised. Highly recommend. - Lori R.",
    "comment 5": "square tissues boxes fit perfectly inside. it is well-made and looks really nice. definitely think it’s worth the cost. i use this at my desk at work, and my cell phone and cordless work phone fit perfectly together inside the extra compartment. - Tyler & Stephanie Stouffer",
    "Keyword": "tissue box cover",
    "Status": "",
    "Total reviews": "2,895"
}