{
    "Product title": "Black Shower Curtain Rod 31 to 80 Inch,1 Inch Diameter Adjustable Spring Tension Stainless Steel Telescoping Rod,Easy Install,No Rust",
    "Buy on Amazon": "https://www.amazon.com/dp/B0C6KHGK42?tag=aijento-20",
    "Price": "$14.99",
    "Current Price": "$14..99",
    "Was": "$19.99",
    "Discount": "-25%",
    "Rating": "4.4 / 5.0",
    "Total review": "-6,385",
    "Brand": "CorkLatta",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61ZIF4VgDeL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71+ZsyP9ibL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71fsKlw9MhL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71pQZiWL10L._AC_SL1500_.jpg",
    "Key Features": "Adjustable:The telescopic design allows for easy adjustment and customization to fit your specific space.This adjustable shower rod can extend from 31 to 80 inches. | Sturdy And Durable:The shower rod uses a high pressure spring tension to securely hold the rod in place,and it can easily support up to 30 pounds of weight. | Easy Installation:No tools required for installation, simply twist to tighten and it won't rust thanks to its stainless steel construction.The shower rod is not only easy to install, but also easy to maintain. | Versatile:The tension rod can be used not only as a shower curtain rod, but also as a closet rod, window curtain rod, or for hanging other items. | Rust-Proof:The shower tension rod is made of stainless steel,resistant to rust and corrosion, ensuring that it will look great for years to come. And it is also easy to clean, so you can keep your bathroom looking its best with minimal effort.",
    "ASIN": "B0C6KHGK42",
    "Affiliate Link:": "https://www.amazon.com/dp/B0C6KHGK42?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/933a8677-7046-44f6-84f8-246d18d1e785/default.jobtemplate.hls.m3u8",
    "comment 1": "Easy to put up and looks gorgeous, matches my brushed nickel moldings and faucet. Hopefully since it’s stainless it won’t rust like previous ones (different brand). It is very sturdy and holds to the wall well. It’s really light too so easy to hold. Nice thickness for the curtain rings. - Des",
    "comment 2": "I was pleasantly surprised by how solid this shower curtain rod is. The bronze finish looks high-quality in person and blends in perfectly with my bathroom hardware. Installation took less than five minutes—no tools needed. The tension is strong, and once it’s in place, it doesn’t loosen or slide down like cheaper rods tend to do.What I appreciated most is that the rod adjusts smoothly from 31” to 80” without feeling flimsy or unstable at the longer lengths. Even with a heavy fabric shower curtain and liner, it stays completely secure. The ends grip the wall well without damaging the paint.If you’re looking for a shower rod that feels durable, stays put, and elevates the look of your bathroom, this one is worth it. I would buy it again for other rooms. - Brittany Fragala",
    "comment 3": "I needed a sturdy, rust-resistant shower curtain rod that could adjust to different lengths, and this one has been perfect. The installation was incredibly easy—no tools, no drilling, and it only took a couple of minutes to put in place. The spring tension design holds very firmly, so there’s no slipping or sagging, even with a heavier curtain.The 1-inch diameter gives it a solid, high-quality feel, and the matte black finish looks sleek and modern in the bathroom. It really adds a nice touch of style compared to cheaper-looking chrome rods. I also appreciate that it extends up to 80 inches, which makes it versatile enough for different spaces and setups.Another major plus is that it’s stainless steel and truly rust-resistant. After regular use with plenty of steam and moisture, it still looks brand new with no signs of wear. The telescoping adjustment is smooth, and once it’s locked in place, it feels very secure.Overall, this rod combines durability, style, and easy installation at a great price. If you’re looking for a reliable tension shower rod that looks good and holds up over time, I’d definitely recommend this one. - Adam Brinson",
    "comment 4": "Keep in mind that this shower curtain rod is sectioned, not extending. That said, it is very solid and has a tight, secure grip on the wall once installed. The flat black color looks great and feels high quality. After several weeks of use, I have not noticed any scraping, chipping, or changes to the finish. Overall, this is a well-made, sturdy curtain rod that performs exactly as expected. Highly recommended. - James kendrick",
    "comment 5": "TOOK ME A FEW MINUTES TO FIGURE OUT HOW TO GET THE RIGHT SIZE, BUT ONCE I DID, I LOVE HOW STURDY IT IS AND IT STAYS UP RIGHT WHERE I NEED IT. I USE IT TO HANG UP THE LAUNDRY WHILE IM FOLDING AND IT DOES FALL DOWN, HOLD A LOT OF WEIGHT. DURST RUST, PERFECT THICKNESS, AND GREAT PRICE SPECIALLY SINCE IT CAN BE DIFFERENT SIZES. - Andrea Douglas",
    "Keyword": "shower curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}