{
    "Product title": "MR.SIGA Toilet Bowl Brush and Holder, Premium Quality, with Solid Handle and Durable Bristles for Bathroom Cleaning, Gray, 1 Pack",
    "Buy on Amazon": "https://www.amazon.com/dp/B08TM5KQ4K?tag=aijento-20",
    "Price": "$19.99",
    "Current Price": "$19..99",
    "Was": "$21.98",
    "Discount": "-9%",
    "Rating": "4.5 / 5.0",
    "Total review": "-16,815",
    "Brand": "MR.SIGA",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61RQBcTJFhL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61dePK3yXjL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71Z8V3lg4WL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71qTG0Uiy7L._AC_SL1500_.jpg",
    "Key Features": "DURABLE CONSTRUCTION & ELEGANT DESIGN- Durable and dense PP fibers create long lasting bristles for strong cleaning ability but won't scratch the toilet bowl. Flat base secures the toilet bowl brush holder sitting in the bathroom steadily and won't slide easily. Elegant and stylish design works for any bathroom, it's a must-have accessory for your toilet bowl cleaning. | SOLID & ERGONOMIC HANDLE - Features a thick and solid handle which fits comfortably in hand and ensures a firm grip while cleaning. 15.8\" solid handle brings you more convenience and allows for powerful scrubbing, leaves your toilet bowl spotless and sanitary. Ideal for residential, commercial, and industrial applications. | REPLACEABLE BRUSH HEAD & SANITARY AND EFFICIENT CLEANING - Strong bristles are not easy to get deformed which remove stains easily, the dense bristles offer thorough and deep cleaning for under-rim area and those hard-to-reach corners. Water easily drips off bristles into bottom of holder, brings you a refreshing cleaning experience. For replacement brush head, please refer to ASIN B08YRRDKDQ. | UPGRADED VENTILATION DESIGN - Lid opens automatically when toilet brush is lifted, and bottom ventilation allows for quick evaporation; Lid closes simultaneously when you place toilet brush back into holder, and the upper ventilation starts working which provides hygienic air dry. Compact space saving design keeps your toilet brush hidden and offers a sanitary storage. | MR.SIGA's mission: Make your housework easier, and make the world cleaner.",
    "ASIN": "B08TM5KQ4K",
    "Affiliate Link:": "https://www.amazon.com/dp/B08TM5KQ4K?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/60163108-0693-4cf1-aabd-7e2181ca6410/default.jobtemplate.hls.m3u8",
    "comment 1": "I typically use disposable toilet bowl cleaners, but after they kept falling apart, I decided to switch to a more permanent option—and this one did not disappoint. The handle is very sturdy, and the bristles are firm enough to really scour and thoroughly clean the toilet bowl. I especially love the self-opening and closing container; it’s a great design feature that helps to keep the brush hidden and hygienic. The container is a good size and discreet enough to hide nicely behind the toilet when not in use. This is a durable, well-made cleaning tool and I’m very happy with this purchase. - Jeanne Davis",
    "comment 2": "This is actually a really nice toilet brush (if there is such a thing). I like that the top of the container conceals the brush and it’s easy to get in and out. It has stayed relatively clean and is a good size. - Jessica Kowalczik",
    "comment 3": "It’s fine. Kinda cheap looking but, it’s works and blends in to my bathroom decor. - Carla",
    "comment 4": "I purchased two of these.  I’m glad I did.  Both worked perfectly as described. Attractive and good quality. If I needed another one I wouldn’t hesitate to. - Kenneth Cook",
    "comment 5": "These are great brush cleaners. - J",
    "Keyword": "toilet brush",
    "Status": "",
    "Total reviews": "2,895"
}