{
    "Product title": "Barossa Design Plastic Shower Liner Clear - Premium PEVA Shower Curtain Liner with Rustproof Grommets and 3 Magnets, Waterproof Cute Lightweight Standard Size Bathroom Curtains - Clear",
    "Buy on Amazon": "https://www.amazon.com/dp/B08QRFZ6TH?tag=aijento-20",
    "Price": "$8.95",
    "Current Price": "$8..95",
    "Was": "$9.99",
    "Discount": "-10%",
    "Rating": "4.5 / 5.0",
    "Total review": "-91,635",
    "Brand": "Barossa Design",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/7136-eapqKL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71f4dwysO5L._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71z6IOGF48L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71dYVaOCC6L._AC_SL1500_.jpg",
    "Key Features": "Premium PEVA: 3 magnets at bottom & 12 metal grommet holes, it can be used as a stand-alone shower curtain or shower liner | Waterproof: The plastic shower curtain is quick to dry, keeps the water into your tub and no soaking compared to fabric liners, great inside shower liner to protect your outer curtain | Lasting Durability: This clear shower curtain liner is sturdy with rustproof metal grommets and reinforced header, can last a long time | Light Weight: The clear shower curtain is easy to wipe and dry quickly, keeping your bathroom clean | Measures: 72\" length standard size, this peva shower curtain liner will fit your bathroom scheme at any home, apartment, condo, hotel, school shower, athletic club, gym and everywhere else",
    "ASIN": "B08QRFZ6TH",
    "Affiliate Link:": "https://www.amazon.com/dp/B08QRFZ6TH?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/90d001f6-f545-4f9a-9243-6ef891f5bc3c.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd5332d4-f9ff-44aa-82fb-1bb8ee4fda64/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd5332d4-f9ff-44aa-82fb-1bb8ee4fda64/videopreview.jobtemplate.mp4.default.mp4,default,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/cd5332d4-f9ff-44aa-82fb-1bb8ee4fda64/1f65b9fd-a470-44d8-a45b-c4ea2d0a46e0/041391cb7047473a9e26c0498d911a9a_0-100-0-100_gandalf_preview.m3u8",
    "comment 1": "This Barossa Design Long Shower Curtain Liner is exactly what I needed. The material is thick and durable, yet lightweight enough to hang nicely without clinging. It keeps water inside the shower, dries quickly, and resists mold and mildew very well.The length is perfect for standard and taller showers, and installation was easy. Overall, a high-quality, practical liner that’s worth the purchase. - Mike",
    "comment 2": "Bought this to replace a liner I've had for nearly 20 years that just didn't get clean any more unless I took it down and threw it in the washer with some vinegar.  Too much hassle!  As my son and his lady are coming for Christmas, I decided it was time to replace the old liner.  Because the opening on my tub runs down one side and down the back I had to use two liners (cutting one down) to cover the space before.  This one covers the entire opening PERFECTLY!!!  It has a nice weight and even has little magnetic weights intermittently at bottom to keep it in place.  It's perfectly clear, smooth, and looks great. A great shower liner at a great price!! - Cindy Scott",
    "comment 3": "This is a good basic shower curtain. Good value for the price. It is a nice heavy, thick plastic. That’s the best part. The rings quality is just ok, basic plastic rings. It was packed nicely and easy to put up. The only reason why I didn’t give it 5 stars, is because it was listed as soap scum and water spot resistant, but I’ve had it up for about a week now, and it has some soapy scum residue and water spits all over it. So far not terrible though. The weights in the bottom help substantially to keepIt in place. Color is nice and clear - exactly as listed. Size fit perfect in my shower. Good if you just want a basic shower curtain. - Amanda Lee",
    "comment 4": "This shower curtain liner is much better quality than cheap plastic ones. The magnets at the bottom keep it perfectly in place against the tub wall, preventing any annoying drafts or water leaks. It's easy to clean, mildew-resistant, and drapes nicely. A simple product that does its job perfectly! - Noah Ferguson",
    "comment 5": "Excellent purchase. Water slips down easily and I’ve found no humidity issues in the fabric in all the months that I’ve used it so far (and I’ve gotten it all soaked in water one or two times by accident). Also, the fabric doesn’t look like cheap plastic, it actually makes my bathroom look fancy while keeping it dry! Love the color! - Amazon Customer",
    "Keyword": "shower curtain",
    "Status": "",
    "Total reviews": "2,895"
}