{
    "Product title": "Tissue Box Cover Holder, Square with Bottom Belt by Carrot's Den - PU Leather Decorative Organizer for Tabletop, Bathroom, Car, Office | Beige",
    "Buy on Amazon": "https://www.amazon.com/dp/B091DN26MQ?tag=aijento-20",
    "Price": "$7.99",
    "Current Price": "$7..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.8 / 5.0",
    "Total review": "-4,419",
    "Brand": "Carrot's Den",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/51b0UhbhcmL._AC_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/51MNADFt6dL._AC_SL1120_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/512U+Ky7p8L._AC_SL1024_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61p4b9CfBLS._AC_SL1499_.jpg",
    "Key Features": "Pu Leather | FUNCTIONALITY - The bottom velcro belt keeps the box securely so you never have to worry about the tissue box falling out; Perfectly sized (5.25x5.25x5”) to hold most standard-sized square tissue boxes | EASY REFILLS - Just open the velcro belt at the bottom for easy replacement of empty tissue boxes | ELEGANT STORAGE - Dress up square tissue boxes with this stylish cover; The clean, minimal and modern design is perfect for home and commercial use; This is the missing piece in your room design that will complement any interior decor | CONVENIENT TO STORE - Made with premium quality PU leather; Can be folded for easy storage; Cleaning is also easy; Just wipe with wet cloth",
    "ASIN": "B091DN26MQ",
    "Affiliate Link:": "https://www.amazon.com/dp/B091DN26MQ?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/0cc191ba-ce76-4a54-99c3-459b2651cf90/default.jobtemplate.hls.m3u8",
    "comment 1": "This leather-look square tissue box cover is such a pleasant surprise. It looks much more expensive than it is—really well made, sturdy, and easy to use. The strap across the bottom is a great touch—it keeps the tissue box securely in place, so you can pick it up and move it without anything slipping out. The color adds a nice accent wherever you put it. I included a picture so you can see how nice it looks. For the price and quality, this one’s a definite recommend! - Armour Home",
    "comment 2": "These are great for helping tissues blend with home aesthetics. They look neat and tidy. The size fits tissue boxes well, and tissues are still easily accessible. This product looks more expensive than it is  and is a great value! - M Frederick",
    "comment 3": "Very chic (and affordable) bathroom decor ! This leather-look tissue cover adds a classy, textured touch to any space. I bought it after seeing it in a beautifully decorated hair salon.Product features: Velcro closure. Wipes easily. Fits the tissue boxes well. Quality is good and it’s lightweight.Purchased same color for all 4 of my bathrooms. - Simple Life Shares",
    "comment 4": "These are high-end looking, very nice sitting on the counters throughout the house.  Have one in each bathroom.  Classic colors, so far have been very durable. Easy to change out the tissue box... the bottom is open, just one velcro strap.  Recommend! - Travel77",
    "comment 5": "Looks great very light , elegant and cozy .Fits very well to the tissue box .Very easy to apply and remove . - Amit",
    "Keyword": "tissue box cover",
    "Status": "",
    "Total reviews": "2,895"
}