{
    "Product title": "Christmas Tree Shower Curtain,Winter Boho Shower Curtains for Bathroom Fabric Washable Green 72x72 Inches",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FJQZYCSV?tag=aijento-20",
    "Price": "$16.98",
    "Current Price": "$16..98",
    "Was": "",
    "Discount": "",
    "Rating": "4.8 / 5.0",
    "Total review": "-65",
    "Brand": "LYLYCTY",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71o97hibXoL._AC_SL1200_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71R8O9x3TAL._AC_SL1200_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71YHGmEY9bL._AC_SL1200_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/614PjoT3wfL._AC_SL1000_.jpg",
    "Key Features": "Package Includes:1pc 72*72inch Christmas Shower Curtain (No Hooks) | Material:This Christmas Tree shower curtain for Bathroom is made of polyester fabric, waterproof, easy to dry, lightweight and durable, lightweight, durable and resistant to soaking for use without a liner and thick enough to protect privacy | Standard Size: This Winter Holiday Shower Curtain 72x72 Inch Christmas shower curtain fabric is suitable for most bathrooms, showers and bathroom curtains, its length can well prevent water from splashing outside and keep your bathroom dry and clean | Easy to Clean: The Christmas fabric shower curtains can machine washed, quick drying, easy to care, low temperature drying or natural drying is recommended | Multipurpose: This green Christmas shower curtain will brighten up your bathroom, suitable for showers, bathtubs, bathroom decorations, homes, hotels, parties, etc., adding Christmas holiday atmosphere to your bathroom and home",
    "ASIN": "B0FJQZYCSV",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FJQZYCSV?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c41edae-56bf-4bd1-9a7b-f7b08cc7c646/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/4c41edae-56bf-4bd1-9a7b-f7b08cc7c646/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "Beautiful and great quality! - Johana",
    "comment 2": "Obsessed with this shower curtain! It’s adorable, festive, and the pink Christmas trees just make me way happier than a bathroom item probably should. The colors are bright, the material feels great, and it instantly transformed my bathroom into full-on holiday cheer.If you love pink, Christmas, or just want your bathroom to look like it’s starring in its own Hallmark movie, this is the one. Highly recommend! - Kayla Leeann",
    "comment 3": "Adorable shower curtain!! - Tbird",
    "comment 4": "Love it! True to color and design. - Sarah H",
    "comment 5": "Such a cute holiday touch for my bathroom! Easy to install & it’s the perfect size/length. The value for money helps at Christmas. - Alica carver",
    "Keyword": "christmas shower curtain",
    "Status": "",
    "Total reviews": "2,895"
}