{
    "Product title": "Vtopmart 25 PCS Plastic Drawer Organizers Set, 4-Size Versatile Bathroom and Vanity Drawer Organizer Trays, Storage Bins for Makeup, Bedroom, Kitchen Gadgets Utensils and Office",
    "Buy on Amazon": "https://www.amazon.com/dp/B0DHC8QSZN?tag=aijento-20",
    "Price": "$19.99",
    "Current Price": "$19..99",
    "Was": "$0.80",
    "Discount": "",
    "Rating": "4.7 / 5.0",
    "Total review": "-40,016",
    "Brand": "Vtopmart",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71GWi6SwmFL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71DDU3zCrML._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/817D0iTKzuL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81peINVeaZL._AC_SL1500_.jpg",
    "Key Features": "【Make Everything Organized】These clear versatile drawer dividers trays are perfect for any place in your home. Fit all kinds of drawers, such as vanity / bathroom / kitchen / office drawers/ craft room, ideal for organizing cosmetics, makeup tools, hair accessories, jewelry, pins, office supply, craft supplies, utensils, etc. | 【Combination of 4 Different Sizes】One set includes 25pcs storage bins in 4 different sizes, which help you customize combinations to store items and organize drawer in shelf/ closet/ cabinet/ dresser . Includes: 9 x 6 x 2 inches (3pcs), 9 x 3x 2 inches(6pcs), 6 x 3 x 2 inches(8pcs), 3 x 3 x 2 inches(8cps). | 【Non-Slip and Durable】Extra 200pcs silicone pads are included, just stick them on the bottom of the plastic trays for non-slip. Made of durable and clear plastic, so you can see what’s in it without digging around or making a mess, help you get a neat lifestyle. | 【Stackable Storage】The drawer bins can be stacked into one other when you not use them, that will save much space and organize well. You will find it's so easy to keep things neat and tidy. | 【Easy to Clean】Our desk drawer storage bins are easy to be wiped clean with a damp cloth and perfect for keeping everything in its place. Convenient for use in your daily life, make everything look beautiful and better organized.",
    "ASIN": "B0DHC8QSZN",
    "Affiliate Link:": "https://www.amazon.com/dp/B0DHC8QSZN?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/dbb15c07-924a-420f-a3bf-9054615346a3.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa5a41a0-a5b5-4ace-a70f-73dd5dbb0346/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/fa5a41a0-a5b5-4ace-a70f-73dd5dbb0346/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "These are nice small little drawer organizers. They were smaller than I imagined. However, they fit very well in drawers and I was able to get more in a drawer to keep everything stored away nicely. Nice quality and looks clean. - powerofdiscernment",
    "comment 2": "I'll make thus short and sweet. BUY THESE! The selling point on this product is that they have little rubber feet that you stick on the bottom so that the bins don't move around. They stay where you put them. Price is great for the amount you receive and it's a sturdy product, well enough made. And it's come in all kinds of colors!  Organize till your heart is content. You won't be upset with this simple purchase, that can make you feel so happy when you're finished with the task of organizing like a professional. - shadowdoll",
    "comment 3": "I love the space these help save when organizing a drawer. These come in different sizes allowing for different configurations for different size projects and drawers. The pros to this products is the different sizes making it more functional for different consumers. The quality is great it is plastic but very sturdy. This is a very versatile products and is a 10/10 recommendation for anyone wanting organization. I don’t have any cons for this product - Troy Tolar",
    "comment 4": "If you want practical, affordable, and attractive organization, clear plastic vanity organizers are a great choice. Pair them with a decorative tray or small accents to elevate the look of your vanity ✨. - Mily",
    "comment 5": "",
    "Keyword": "bathroom organizer",
    "Status": "",
    "Total reviews": "2,895"
}