{
    "Product title": "Self Draining Soap Dish Holder,Silicone Soap Dish,for Bathroom,Kitchen, Sponges，Can Extend Soap Life，Keep Soap Bars Dry and Easy Cleaning (Black,1-Pack)",
    "Buy on Amazon": "https://www.amazon.com/dp/B0CLLJ8FLP?tag=aijento-20",
    "Price": "$13.69",
    "Current Price": "$13..69",
    "Was": "",
    "Discount": "",
    "Rating": "4.5 / 5.0",
    "Total review": "-540",
    "Brand": "Coipdfty",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61Srd8ns+CL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71T21SalDCL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71Ji8hRrmoL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/715OH2GeCKL._AC_SL1500_.jpg",
    "Key Features": "Perfect Size: These soap holders measure 9.6 x 7 x 4 cm / 3.78 x 2.75 x 1.57 inches, and they feature grooves to prevent bar soap from sliding. | Premium Silicone Construction: Our silicone soap dishes are made from high-quality, flexible silicone, ensuring durability and long-lasting use. | Self-Draining System: The waterfall drainage system in our soap dish with drainage keeps your soap dry, preventing mushiness and extending soap life. | Versatile Usage: These bar soap holder are perfect for the shower, kitchen, or bathroom, offering a secure spot for your soap. | Sleek and Modern Design: You will receive 1 silicone soap dishes that come in a stylish, modern design, perfectly complementing your home decor.",
    "ASIN": "B0CLLJ8FLP",
    "Affiliate Link:": "https://www.amazon.com/dp/B0CLLJ8FLP?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/564758e8-0a69-4d46-bc52-69e61dde66f8/default.jobtemplate.hls.m3u8",
    "comment 1": "Love this soap dish.  No more icky soap.  It drains, doesn't leave soap wet and since water drains off even the soap holder stays nice.  This soap dish makes me happy :) - Grammy",
    "comment 2": "I recently purchased this soap holder for its unique design hoping that it would live up to its hype of keeping my bath soap dry and clean between uses. I’m certainly impressed with the quality and durability of the silicone soap dish and it does truly work! I have mine in my shower and it’s easy to grab the soap and helps keep the soap securely where I place it. It’s perfectly sized for a traditional bar of soap and I’ve had no issues of the soap slipping off when I’m finished using it. It’s fantastic at keeping your soap dry between uses and definitely avoids that awful “slimy goo” effect that occurs when using a traditional soap dish as it sits in water waiting for you to use it again. I didn’t order the one with suction cups because I have my silicone shower soap dish placed in my shower caddy so I can’t comment on the durability and suction power it would or would not have. But, after using this fantastic silicone soap dish for a while I decided I was so pleased with its performance that I just ordered a second one for my spare bathroom. I would certainly recommend this product to anyone who wants a product that solves an issue and works just as described. - Chase",
    "comment 3": "These soap dishes are amazing.  Soap bars don't get squishy or melt in the shower.  Water pours out through the ridges so your soap never sits in water to get slimy.  It just dries out.  They're not pretty and they're heavy but they do a great job. Highly recommended. - SoCal Reader",
    "comment 4": "Great. Let soap dry, easy to remove to use. - Sherry Goldsmith",
    "comment 5": "As expected. Very nice.  Stays put does its job. - Dave",
    "Keyword": "soap dish",
    "Status": "",
    "Total reviews": "2,895"
}