{
    "Product title": "Shower Curtain Rod 31 To 76 Inch,Black Tension Curtain Rod 7/8\" Diameter Spring Loaded Curtain Rods No Drilling Shower Rods For Bathroom,Window,Kitchen,Closet,4pcs",
    "Buy on Amazon": "https://www.amazon.com/dp/B0G2B9K24F?tag=aijento-20",
    "Price": "$37.99",
    "Current Price": "$37..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-7",
    "Brand": "MEXAU",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71DVaPPgiAL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/717aGd2hbBL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71I0aKzaQOL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71ibBoEKi9L._AC_SL1500_.jpg",
    "Key Features": "【Wide Adjustable Range with Modular Tube Set】This shower curtain rod​ extends from 31\" to 76\", built from 1× A-telescopic rod (42 cm), 2× B-extension rod (38 cm each), 1× C-extension rod (25 cm), and 1× D-tail rod (38 cm). The mix-and-match design lets you adapt to different tub and shower widths, making it a versatile shower rod​ for both compact and spacious bathrooms. | 【Stable Load Capacity & Solid Build】Supports up to 3 kg (≈6.6 lbs) with a strong 22 mm outer diameter and 0.4 mm wall thickness; works well as a tension curtain rod​ or tension rod​ for hanging shower curtains, liners, or lightweight storage accessories. | 【Durable Rust‑Resistant & Water‑Resistant Metal】Made from premium metal with anti‑rust coating and water‑resistant finish; non‑slip rubber ends keep the shower curtain rod​ firmly in place, even in humid environments, ensuring long‑term use. | 【Tool‑Free, Wall‑Safe Installation】No drilling, screws, or adhesives required—just twist to expand and lock into position. A perfect curtain rods no drilling​ option for apartments, rentals, or any home where walls must stay undamaged. | 【Multi‑Scene Use & Quick After‑Sales Service】Ideal for bathtubs, showers, closets, changing areas, balconies, and laundry rooms as flexible curtain rods; also handy as a tension rod​ around the house. Our customer service team replies within 24 hours for fast support.",
    "ASIN": "B0G2B9K24F",
    "Affiliate Link:": "https://www.amazon.com/dp/B0G2B9K24F?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5f7a258a-415b-4106-930b-e818bb53e0fd/default.jobtemplate.hls.m3u8",
    "comment 1": "This tension rod is really nice for the price and is useful for a lot of different things.I needed a makeshift curtain rod solution and this tension rod gets the job done in fine fashion.Its length is adjustable which is also very convenient and increases the amount of different things it can be used for.Despite not needing its tension use in my application, I tested the tension out and it indeed provides ample tension. It can easily be used in doorways or closets for different types of hanging rod solutions.For the reasons outlined in this review I give this tension rod a good recommendation. Purchase with confidence! - Jacob",
    "comment 2": "I was impressed with the high quality of this tension rod! Very good value and the tubing is thicker than other tension rods I have had which makes it stronger. Most of all I love that it is black! So much classier than the white ones.  I installed it in our RV bathroom because we have nowhere to hang handwashed items or damp clothing. It was the perfect size and easy to install. It can be shorter by leaving out the center section but I needed it full length to go across the shower. - dianne",
    "comment 3": "I'm not really impressed with this tension rod - the quality is on the poorer side and it doesn't compress much so that you can really get a good tension with the rod. Very thin material.It does look nice and holds the curtain like I wanted it to so it works but I don't think it's really worth the price, I've had better. - Kristy0404",
    "comment 4": "This adjustable tension curtain rod is a wonderfully practical solution for adding curtains without any drilling or hardware. The 24‑ to 46‑inch range gives it plenty of flexibility, making it easy to fit windows, closets, kitchens, or even small doorways. The spring‑loaded design holds firmly in place, and the black finish adds a clean, modern touch that blends well with different décor styles. It feels sturdy once installed and doesn’t slip, even with daily use. For renters or anyone wanting a quick, damage‑free setup, this rod delivers convenience, reliability, and a polished look in one simple tool. - Jason",
    "comment 5": "Great 24-inch to 46-inch black tension rod. Adjustable spring loaded and so simple to install without wall damage. You simply put 3 pieces into the round slot and turn the end of the pole lefty Loosie to extend. Great quality made and great value for the price. The perfect size every time between 24- 46.\" Can use in so many places, like the shower, kitchen window, closet, or doorway, and so on.Very lightweight but durable. - Catherine Moore",
    "Keyword": "tension curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}