{
    "Product title": "Tub Drain Linkage Assembly with Trip Lever, Bathtub Overflow Stopper Switch Hardware, Bathroom Trim Kit Cover Replacement (Two-Hole Faceplate + Drain Plug)",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FXWY84RM?tag=aijento-20",
    "Price": "$23.97",
    "Current Price": "$23..97",
    "Was": "$21.69",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "",
    "Brand": "Welvzen",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61W7ZfZZEAL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61Sm6hrtLTL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71FmtAiJb7L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61gKtxS0fdL._AC_SL1500_.jpg",
    "Key Features": "FIX THE LEAKING - The new tub drain linkage assembly will help our customers to fix the tub leaking problem. By replacing the linkage assembly, you will be able to lock the water inside of the tub securely without the leaking problem. The tub drain linkage assembly with trip lever will help to keep the water in the bathtub to a desired capacity. | EASY INSTALL - With the necessary tools, the bathtub drain linkage is very straight forward. No previous experience required. You can replace the bathtub drain lever in 5MINS and fix the leakage shortly, in the mean time, save a lot. The new drain linkage assembly is very easy to install. Just pull out the old bathtub drain trip lever and replace it. Simple as it is! | DURABLE MATERIAL - The tub drain lever is made of high quality materials. The linkage assembly is made of premium brass and the drain kits are made of high quality steel to keep it working under water conditions. The trip lever drain stopper is designed to provide working life for decades to come. Enjoy a worry free bathtub after installtion. | NEW SHOWER - Miss the tub shower for a long time? Not any more! Now you can enjoy the tub shower as long as you want. The bath tub trip lever keep the water inside of the tub and makes you feel warm. You can flush the water by simples swtich the lever and all is done. The new bathtub trip lever brings back your always wanted tub shower now! | CARING SERVICE - We know the plumbing job sometimes can be overwhelming if no experience before. Don't worry, we understand your feelings. We also know that not everyone is a skilled DIYer. We are always here to help with the bath tub lever. For any assistance needed with the trip lever tub drain kit, we will be available within 24h and help our customers to address any issues.",
    "ASIN": "B0FXWY84RM",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FXWY84RM?tag=aijento-20",
    "Video": "",
    "comment 1": "",
    "comment 2": "",
    "comment 3": "",
    "comment 4": "",
    "comment 5": "",
    "Keyword": "tub stopper",
    "Status": "",
    "Total reviews": "2,895"
}