{
    "Product title": "Toilet Plunger and Brush Set, Bowl Brush and Heavy Duty Toilet Plunger with Ventilated Holder, 2-in-1 Toilet Brush and Plunger Combo for 5.3-inch Toilet Drain Bathroom Deeply Cleaning(White & Grey)",
    "Buy on Amazon": "https://www.amazon.com/dp/B0CPDNF1CB?tag=aijento-20",
    "Price": "$15.99",
    "Current Price": "$15..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-480",
    "Brand": "Brand: TRENTI",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71sf4Gez2mL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/7117E05T-ML._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71bvzJm7XkL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71dc6p1hQTL._AC_SL1500_.jpg",
    "Key Features": "2-IN-1 TOILET BRUSH PLUNGER SET: Why have a separate brush caddy & toilet plunger with holder when you can save space with our all-in-one black toilet brush set? The ultimate plunger toilet brush combo, it includes a plunger, scrubber and holder. | HEAVY DUTY BATHROOM PLUNGER: The toilet bowl cleaners brush and holder set also comes with a powerful two-way rubber plunger. Easily convert it into a toilet plunger or drain plunger to plunge clogged toilets, sink drains, shower drains and more. | MODERN TOILET SCRUBBER BRUSH: A must-have bathroom cleaning brush, the scrubbing brush that comes with our toilet bowl brush and plunger set features a 360° brush head with dense bristles that make it easy to clean hard-to-reach spaces. | BRUSH HOLDER WITH VENTILATION: Store toilet brushes out of sight and ventilated with the sleek toilet brush caddy. Featuring discreet storage compartments for both the toilet brush and plunger, the drainage stand maintains organization and hygiene. | ERGONOMIC LONG HANDLE AND RISK-FREE BUY: Ergonomic long handle features a secure and comfortable grip, makes your plunging more effectively, clean clogged toilets like a pro! The space-saving toilet brush + toilet plunger combination can be used in residential, industrial and commercial environments.",
    "ASIN": "B0CPDNF1CB",
    "Affiliate Link:": "https://www.amazon.com/dp/B0CPDNF1CB?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/30e64600-4873-424b-9a1e-1d7873ebcb1a/default.jobtemplate.hls.m3u8",
    "comment 1": "Really like the clean look and the all in one set!  The product is made very well and looks great against the white toilet!  Can not beat the price! - Aa-Ron",
    "comment 2": "A good quality set that is easy to use and of durable.  The size is just right and the holder keeps the floor clean.  I wasn't sure I would like the brush but it does a good job. - Winnie DeBauche",
    "comment 3": "Good product - Amy B",
    "comment 4": "Easy to assemble. - John F. Zauner",
    "comment 5": "Does a great job cleaning, AND it fits inside vanity, under the sink. Out of sight, out of mind. 😌 - Sean",
    "Keyword": "toilet brush and plunger set",
    "Status": "",
    "Total reviews": "2,895"
}