{
    "Product title": "Blanket Ladder, 5-Tier Towel Holder with 4 Removable Hooks, Farmhouse Wall Leaning Decorative Rack Shelf, Wooden Towel Display Rack, Quilt Ladder for Living Room, Bedroom, Rustic Brown",
    "Buy on Amazon": "https://www.amazon.com/dp/B0D31GTDH6?tag=aijento-20",
    "Price": "$19.99",
    "Current Price": "$19..99",
    "Was": "$29.99",
    "Discount": "-33%",
    "Rating": "4.4 / 5.0",
    "Total review": "-222",
    "Brand": "Vantimo",
    "Availability": "",
    "Product Image 1": "https://m.media-amazon.com/images/I/711agwIspHL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81eEk+SW6eL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/81iCH5ivJcL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81LXkjucfxL._AC_SL1500_.jpg",
    "Key Features": "Your Storage Assistant: The blanket ladder can be used in indoor corners such as bedrooms, living rooms, bathrooms, and home offices. In addition to serving as a display stand for blankets, it can also be used to place clothing such as shawls, scarves, or bath towels, making the home cleaner and more organized | Space Saving Design: This tilted blanket holder is cleverly designed, not only suitable for storing towels, blankets, blankets, or bath towels, but also has 4 detachable and movable hooks that can hang coats, scarves, and hats, making it a highlight of room decoration without taking up too much space | Friendly to Walls and Floors: Unlike traditional metal towel racks, this blanket display shelf features a high-quality metal frame paired with vintage Particleboard, giving the blanket drying rack high stability and load-bearing capacity to prevent the rack from slipping and damaging the floor. And the top silicone protective cap can effectively prevent the display rack from scratching your wall surface | Easy to Match: This blanket holder design is simple and elegant, using clean lines and rural retro colors, without excessive decoration, not limited by decoration style, allowing the blanket rack to match with various furniture and decorations, providing more possibilities for free matching in your home space | Quick Assembly and Use: This ladder for blankets and towel comes with detailed assembly instructions and tool kit, allowing for easy assembly without the need for professional tools or skills, and immediate enjoyment of use",
    "ASIN": "B0D31GTDH6",
    "Affiliate Link:": "https://www.amazon.com/dp/B0D31GTDH6?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/bac604e6-f97a-4ead-8b7f-eb5a37117858/default.jobtemplate.hls.m3u8",
    "comment 1": "Super good quality and easy to assemble. I ended up setting this up on my own in about 10 minutes. Comes with everything you need. The wrench is cheap and does strip out pretty fast. Use your own and you will be good! Make sure not to over tighten so they line up easily. Great size! It's a super cute addition to my living room area! It holds all of my minky blankets and purses and adds a modern look to my room. - Ashley K.",
    "comment 2": "This blanket rack is amazing, super sturdy and the size is just perfect for a bedroom or living room. The installation was really simple and it is super stable! Would recommend - Branson",
    "comment 3": "Worked out better than I expected!! Love the way it looks. Quality is good. Price was good! - Amazon Customer",
    "comment 4": "Good Blanket Ladder for the price. I didn't give it 5 stars just because it doesn't sit totally flush with the wall, but I angled it a little on the floor and it still works great. Husband usually hangs his heavy jeans, jackets, and ball caps on it at the end of the day and it's been holding up well 7 months later. The faux wood looks real, the hooks are solid, it looks classy, but also functional and helps keep things off the floor. Easy to vacuum around & easy to dust/clean too. Happy with purchase. Oh! Just make sure when putting it together, you follow the EXACT instructions or the parts don't fit together. Each wood shelf only matches to the exact holes it was cut out for/along with the side rails. So if you don't want to have to take it apart and redo it like I did, then follow the instructions and lay it all out and make sure it lines up first. Not hard to do at all. Easy build! I was just being an impatient female. - freerunner",
    "comment 5": "This was easy to put together and works great! - Aaron Evans",
    "Keyword": "blanket ladder",
    "Status": "",
    "Total reviews": "2,895"
}