{
    "Product title": "Titanker Shower Curtain Hooks, Rust Resistant Shower Curtain Rings for Bathroom, Metal Double Glide Shower Hooks Hangers for Bathroom Shower Rods Curtains, Set of 12 Hooks - Blue",
    "Buy on Amazon": "https://www.amazon.com/dp/B08ZS1CL27?tag=aijento-20",
    "Price": "$9.99",
    "Current Price": "$9..99",
    "Was": "$11.99",
    "Discount": "-17%",
    "Rating": "4.6 / 5.0",
    "Total review": "-98,769",
    "Brand": "Titanker",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71NTeLsJ2BL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71G4x7d67gL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/612N1N4dZEL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81bpjlpnqHL._AC_SL1500_.jpg",
    "Key Features": "Smooth gliding - Engineered spherical roller balls of shower curtain hooks can glide smoothly and fast across shower rod. | Double hooks design - The double roller glide shower hooks are strong enough to hold up shower curtain and shower liner. | High quality metal - These double glided shower curtain rings are made of high quality and selected metal. These shower curtain hooks are 3 inches long and fits most standard size shower curtain rods (less than or equal to 1.3 inches). | Plated & polished - Coating is plated and polished on cover of double sided shower curtain hooks to be used as elegant decor to your bathroom. | Set of 12 - Sold as a set of 12 shower curtain rings. Titanker shower curtain hooks meets most of quantity demands for one usual bathroom.",
    "ASIN": "B08ZS1CL27",
    "Affiliate Link:": "https://www.amazon.com/dp/B08ZS1CL27?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/1cbd30b3-4f04-4a89-abbc-dcc4479f03a6/default.jobtemplate.hls.m3u8",
    "comment 1": "I love these. They are pleasant to look at and very easy to use. One hook holds shower liner and shower curtain. Makes it very easy to remove either one for washing. Nice quality, holds well and slides easy. I'd buy them again. - KathyF",
    "comment 2": "love the easy way i can hook the decorative shower curtain on one side, and the plastic curtain on the other. It will not rip or tear the plastic. slides easily on the shower rod. does not come off the shower rod. has not rusted yet - Vivien Garber",
    "comment 3": "Perfect weight and thickness. Good quality. Standard size for regular shower bar. Ease of opening package, including hanging on the shower bar. Makes it very easy to hang, wash, and replace both the shower curtain or the liner. Very happy with the purchase. Excellent value for the money! - DangriestOnE",
    "comment 4": "They’re not bad - especially for the price - but they will eventually rust.  I’m about to replace them.  Here is a picture of them after about a year and a half of daily shower exposure.  I’m just going to buy the same ones because I love how easily I can change the liner and curtain. - Jaime Carter",
    "comment 5": "",
    "Keyword": "shower curtain hooks",
    "Status": "",
    "Total reviews": "2,895"
}