{
    "Product title": "Tissue Box Cover PU Leather Tissue Holder Square Facial Tissue Case Facial Paper Organizer Dispenser for Bathroom, Vanity Countertop, Tabletop, Car, Griege",
    "Buy on Amazon": "https://www.amazon.com/dp/B09ZPN6CQX?tag=aijento-20",
    "Price": "$6.99",
    "Current Price": "$6..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.7 / 5.0",
    "Total review": "-2,486",
    "Brand": "zoocatia",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61abjhUxW6L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/718P4kLiPML._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61Nc+BE9jIL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61E5eNztPQL._AC_SL1500_.jpg",
    "Key Features": "PREMIUM MATERIAL: Made of premium PU leather, our christmas tissue box cover is sturdy, soft, smooth, and easy to clean. You can clean it with a damp cloth. | EASY TO REFILL: In order to make the facial tissue box holder easy to be refilled, we designed it with velcro belt on the bottom, what you need to do is just open the velcro belt and tuck the tissue box into the tissue box cover. | STYLISH AND CLEAN DESIGN: The decorative tissue box holder looks stylish and clean, which would be an inexpensive way to take your decor to the next level. | CONVENIENT TISSUE BOX: Built-in widened slit on top for dispensing the tissue paper, you can reach paper easily without tearing the paper in the box to pieces. With compact figure, The tissue box cover is perfect for bathroom, vanity countertop, night stands, inn, tables, keeping the space functional and tissues handy. | PERFECT SIZE: 5.12 L in × 5.12 W in × 5.12 H in, the cute tissue cover is suitable for most kinds of soft packaging towel paper.",
    "ASIN": "B09ZPN6CQX",
    "Affiliate Link:": "https://www.amazon.com/dp/B09ZPN6CQX?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e8c8345-553a-4086-a785-57197fd07ad1/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/5e8c8345-553a-4086-a785-57197fd07ad1/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "Pretty neutral tan color. Very durable and well made material. It's like a braided like design and texture. Nice and thick material, definitely not cheap. It's very simple but elegant. Holds a square tissue box perfectly. Easy to put the tissue box in and out of it. Sits nicely on my end table, doesn't take up that much space. Functions just as it should. Worth the price. - ItTakesAllOfUs",
    "comment 2": "It looks elegant and is soft but sturdy. Easy to cover the tissue box and made well. The Gold is an attractive color. - Debbie",
    "comment 3": "Very nice tissue holder. Feels like leather and is super cute.  Arrived quickly and was packaged well.  I've had it a few weeks now and the crease (from being folded in packaging) has not quite gone away yet. I'm hoping it will continue to straighten out in a bit more time. - My3Cents",
    "comment 4": "I have bought I think four in total. Love the look to the room of having the Kleenex box covered. Just elevates the space more. Love all the colors so far. Wish the creases came out a little more so it was flat on all sides but I also haven’t put a lot of effort in to making them flat. Will buy more. Appreciate the Velcro strap underneath which helps with it being sturdy. - Brooke Jones",
    "comment 5": "It’s very pretty and the material looks nice. It looks just like the pictures would definitely recommend. - OBED TORRES",
    "Keyword": "tissue box cover",
    "Status": "",
    "Total reviews": "2,895"
}