{
    "Product title": "ALYVIA SPRING Waterproof Fabric Shower Curtain Liner with 3 Magnets - Soft Hotel Quality Cloth Shower Liner, Light-Weight & Machine Washable - Standard Size 72x72, White",
    "Buy on Amazon": "https://www.amazon.com/dp/B08BZFRQLS?tag=aijento-20",
    "Price": "$9.98",
    "Current Price": "$9..98",
    "Was": "$11.75",
    "Discount": "-15%",
    "Rating": "4.5 / 5.0",
    "Total review": "-56,738",
    "Brand": "ALYVIA SPRING",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61S1tvRFMML._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71cBMZpOhQL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71prq9LlkxL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/818-E+a30qL._AC_SL1500_.jpg",
    "Key Features": "100% Polyester: Soft Feel, Light Weight & 3 Bottom Magnets, Machine Washable & Reusable | SOFT & WATERPROOF: This shower curtain liner is made of premium fabric with the ultimate waterproof coating tech, making it completely water proof but still soft feeling | DURABLE: The lightweight shower curtain liner features a reinforced header and rustproof metal grommet eyelets, easy to hang naturally and drapes nicely, long term use as shower liner or curtain | MAGNET-WEIGHTED HEM: 3 magnets at the bottom of the curtain to add extra weight, helps keep the fabric shower curtain liner in place and reduce billowing | QUALITY CONSTRUCTION: This fabric shower curtain with hotel quality is odorless and PVC free & BPA-Free, NO plastic smell like PEVA/EVA. The tightly woven fabric protects curtain from soaking and keep your floors free from splashes and sprays of water",
    "ASIN": "B08BZFRQLS",
    "Affiliate Link:": "https://www.amazon.com/dp/B08BZFRQLS?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6f26f0c-e371-4b0d-a11b-3419c9550480/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6f26f0c-e371-4b0d-a11b-3419c9550480/videopreview.jobtemplate.mp4.default.mp4,default,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6f26f0c-e371-4b0d-a11b-3419c9550480/f5c06cc2-8ade-4b7f-9e9b-fcf83c788b5f/09067a6edf7b41c3ac1454603d560e3a_0-100-0-100_gandalf_preview.mp4,gandalfMp4,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/f6f26f0c-e371-4b0d-a11b-3419c9550480/f5c06cc2-8ade-4b7f-9e9b-fcf83c788b5f/09067a6edf7b41c3ac1454603d560e3a_0-100-0-100_gandalf_preview.m3u8",
    "comment 1": "I really like this shower curtain liner and definitely recommend.  It doubles great as a liner and a shower curtain, although I added a linen shower curtain.  But I plan to use it by itself as well.  The fabric is really nice, , dries quickly, hangs nicely, and the white color is not stark but just right if you're looking for a \"white\" shower curtain that doesn't look off-white. - trish",
    "comment 2": "I've had this liner about a year new and it has done its job without any issues. I prefer fabric liners. It didn't smell like plastic and is easy to clean by tossing in the washer from time to time. Its lighweight, a good thickness, and was the right size for what I needed. Good quality product that does its job and has lasted. I would buy again, and probably will when I raise my shower bar a little higher. - Velocity",
    "comment 3": "This is the best shower curtain I have ever bought, the material is so soft, perfect color it has magnets on the bottom, I love that it is washable and no plastic smell or stiffness. - Amazon Customer",
    "comment 4": "It is very easy to put up as you can clearly differentiate between the inner side and the outer side. The colour shown was definitely what I got; it was very white. The quality is really good but I just wish that it was a bit thicker. The magnets are the best part for me because they stick and stay in place no matter the amount of movement. - SashaMack",
    "comment 5": "We replace our shower curtain about every 6 months because of that pink mold buildup, and we keep buying this exact one because it’s so soft and holds up really well. The fabric feels nice, not stiff or plastic-y, and the extra length looks great in the bathroom.Small downside: Like any fabric curtain, it will eventually need replacing if you deal with moisture or mold.Still, this is our repeat buy for a reason,  great quality and very comfortable fabric. - Demian Solis",
    "Keyword": "fabric shower curtain liner",
    "Status": "",
    "Total reviews": "2,895"
}