{
    "Product title": "Taozun Shower Caddy Organizer Tension Pole, Rustproof 2 Towel Bars and 4 Adjustable Shelves, 25-114.2 Inch No-Drill Quick Installation, Extra Soap Dish for Bathroom Storage Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FGH5XL87?tag=aijento-20",
    "Price": "$37.99",
    "Current Price": "$37..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-18",
    "Brand": "Taozun",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/81X-F7FSDCL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71lkHPMXPvL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/81n6Qo-yN+L._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81C5DOxmEoL._AC_SL1500_.jpg",
    "Key Features": "Dual Towel Bars & Smart Hooks — Keep towels dry and all shower essentials—like loofahs, washcloths, and squeegees—right within reach. No more clutter, just a clean, organized shower space. | Built-In Storage for Bath Essentials — Equipped with dedicated soap dishes, razor slots, and extra hooks for sponges or small tools. Everything stays neatly in place and ready to use. | Fully Adjustable & No Drilling Needed — Easily customize the pole length (25″–114″) to fit any shower or bathtub corner. Ideal for renters and any bathroom layout. | Quick-Drain Design & Upside-Down Bottle Slots — Open shelves prevent water buildup while inverted slots let you store shampoo bottles upside down—so every drop gets used. | High Fence & Large Capacity — Features raised edges to prevent bottles from tipping. Easily holds all your shampoo, conditioner, soap, and other shower necessities.",
    "ASIN": "B0FGH5XL87",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FGH5XL87?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/d59bbddd-39ce-47df-b74e-03fb124f90ff/default.jobtemplate.hls.m3u8",
    "comment 1": "Love it highly recommend!!!!! - Myeeshia",
    "comment 2": "Just installed, so haven’t really used. So far we are pleased with it. I DO suggest following the YouTube video for assistance in putting together and installing as the enclosed directions are hard to read. I also suggest putting the 2 “arms” for hanging lower than suggested. You really need to play with it before installing so it’s according to your liking. - Deby L Bretz",
    "comment 3": "Easy to assemble - bobfly",
    "comment 4": "Great product.  Looks great in the shower and easy clean. - Jennifer B",
    "comment 5": "An excellent item - Rick",
    "Keyword": "shower caddy",
    "Status": "",
    "Total reviews": "2,895"
}