{
    "Product title": "Shower Curtain Rod Adjustable 43-78 inch, 1\"Diameter Spring Tension Curtain Rod No Drill, Anti-Rust Non-Slip Shower Rod, Black Shower Curtain Rod for Bathroom Tension",
    "Buy on Amazon": "https://www.amazon.com/dp/B0C89LS7N2?tag=aijento-20",
    "Price": "$13.29",
    "Current Price": "$13..29",
    "Was": "$18.99",
    "Discount": "-30%",
    "Rating": "4.5 / 5.0",
    "Total review": "-3,108",
    "Brand": "Brand: Thestoa",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/41vvgeBe7hL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/617GkFvMlrL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71gvlbC2bcL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61yptiHWDrL._AC_SL1500_.jpg",
    "Key Features": "Splicing Structure: This black shower curtain rod consists of two end rods and three splicing rods. The size can be increased by adding different numbers of splicing rods. | Anti-Rust Coating: Anti-rust shower rods for bathroom is made of stainless steel tubing. An epoxy resin primer and polyurethane waterproof topcoat are used for better waterproofing,can be used indoors and outdoors. | Durable and Non-Slip: 1\" diameter shower curtain rods spring tension has a strong spring embedded in the inner structure. With non-slip rubber pads on both ends to make it durable enough not to slip. Holds up to 30 lbs. | Multi-purpose: This versatile tension rod can be used as a closet rod. It can also be used as a curtain rods for windows and doors that have support points on both ends. | No drilling required: This tension rod can be used as a no drill curtain rod for windows or door. No installation tools are required, and it is very easy to install.",
    "ASIN": "B0C89LS7N2",
    "Affiliate Link:": "https://www.amazon.com/dp/B0C89LS7N2?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/b5c72956-7c33-4ac1-b9e5-2340a8d78c95/default.vertical.jobtemplate.hls.m3u8",
    "comment 1": "It was so nervous that this would not be strong. I moved into a new apartment about a month ago and the shower curtain rod that they left up is so pathetic lol. I even think that they combined other shower rod parts that don't even go to it, just so that it would look like there was a shower rod in there. Which is fine, it's not something I expect an apartment to provide anyway (unless it was a permanent fixture, then I would expect them to repair something like that).With that being said, I put this one up today and what a difference! The other one would wobble and it just wouldn't stay up and I was scared to put my towels over it. It would hold but I had to be really careful putting my towels on and taking them off. I don't have that concern with this one at all. It was very nice being able to hang up my towels without having to be extra careful.This one looks nice. It definitely has a good grip on the walls. It was super easy to install. I ended up not needing one of the extenders that you put in the center (that's the photo of the one rod that I didn't need LOL). And you also twist the end to make it bigger or smaller and really get firmly placed between the two walls. And as a tip to make it easy for you, if your toilet is next to your tub like mine is? Or you have anything else close to the tub on one side? Make sure you put the side that you can twist on the other side to make it really easy for you to adjust, so that you're not having to lean over stuff and reach while you twist and try to support the bar at the same time.You could say my bathtub\\shower is average size that you would expect to find in most apartments. And clearly, since I didn't need that one rod, you could even use this with a larger shower, or even in window sills for curtains.It is holding up very sturdy. It would be fine with heavier curtains. In my particular situation it's just one clear inner curtain and one lightweight fabric on the outside. So I don't require it to hold a whole lot of weight except for my towels, because my towels are super large, extra absorbant, so they can get kind of heavy especially when wet. But I'm confident this rod can handle the task at hand.If anything changes I will try to update this review but so far I absolutely recommend and I see no reason why that would change. - LakeOfJudea",
    "comment 2": "Great for the shower adjustice very easily the way of it is so light it doesn't rust out all no matter how hot of a shower you take The black finish is beautiful it holds very tightly to any wall or any paint finish wall that may be in your bathroom your living room or your bedroom wherever you suggest to use this curtain rod It works great wish I will curtains window curtains and it's very easy to use and assemble it's no rust and the color stays fresh - DomNique",
    "comment 3": "Works awesome, color is perfect,  very good quality and very durable.  Its light and easy to use. The adjustment are very good. - Cassie Davis",
    "comment 4": "I used them for my window curtains instead  , this one had better reviews and overall orders so I made the right pick . I just put them up so we’ll see if time tells . But it was super easy to put together and to me is luxury on a budget. My curtains are a little heavy but still looks good !Probably will get some more curtains but I just moved in and this is perfect until you upgrade! - Toot",
    "comment 5": "These were okay once they were up. The tightening end took awhile to get in place as you couldn’t easily slide it up without it changing sizes. The joints are a little wobbly, but these were fine for the short term location of the rods. Overall, they are okay and do what they are supposed to do, just a little frustration with getting them up into place. - Jacqueline Lawrence",
    "Keyword": "shower curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}