{
    "Product title": "2 in 1 Toilet Plunger and Brush Set，Extended Handle Plunger，Toilet Bowl Brush Plunger Set, Bathroom Cleaning Tools ，Toilet Brush Plunger Combo，Cleaning Brush，Bathroom Cleaning Supplies",
    "Buy on Amazon": "https://www.amazon.com/dp/B0CGTZPQFS?tag=aijento-20",
    "Price": "$14.99",
    "Current Price": "$14..99",
    "Was": "$17.99",
    "Discount": "-17%",
    "Rating": "4.4 / 5.0",
    "Total review": "-5,528",
    "Brand": "FORASTO",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61vEJByUz+L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71Rq58QU8WL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71nFw2OCzxL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71P8BcbpK5L._AC_SL1500_.jpg",
    "Key Features": "Convenient Storage: 2 in 1 design, convenient for use and storage, keeping the bathroom clean and saving space. | Extended handle -Heavy Duty Toilet Plunger: Compared to ordinary handles, our upgraded extended handle provides a better user experience and prevents stains from splashing onto the hands.A professional powerful suction cup that can solve various blockage problems. Comfortable handles provide greater support during use. | Toilet Brush: Sturdy bristles to remove various stubborn stains, 360 degree deep cleaning of the toilet, not easily deformed. | Convenient Storage: 2 in 1 design, convenient for use and storage, keeping the bathroom clean and saving space. | Unique Stripe Design: Different from ordinary products, it adopts a unique stripe design, making the product more designed and can be paired with various bathroom styles.",
    "ASIN": "B0CGTZPQFS",
    "Affiliate Link:": "https://www.amazon.com/dp/B0CGTZPQFS?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/c8f0c126-b353-4884-9703-e7d471d447f2/default.jobtemplate.hls.m3u8",
    "comment 1": "Perfect set, looks clean, does the trick and the price is fair! Bought 2 sets, one grey and one black, highly recommend. - Coralie Salvail",
    "comment 2": "Easy to assemble, easy to store, good quality, looks good, and easy to use. I recommend - Tiago S.",
    "comment 3": "It’s a great item. - Dontavious",
    "comment 4": "I like the 2 in 1 and the little stand for the plunger. I’m not positive that the plunger will actually work, it seems a bit flimsy to me, but I haven’t had to use it yet. The brush works just fine. - Alyssa",
    "comment 5": "10/10 \"I am very satisfied with the FORASTO 2 in 1 Toilet Plunger and Brush Set. I used it for a toilet clog and, to my surprise, it worked immediately. The suction power is fantastic. Plus, the fact that it comes with the integrated brush is very practical and helps keep everything organized. I definitely recommend it for its effectiveness and convenience.\" - Franchely Perez",
    "Keyword": "toilet brush and plunger set",
    "Status": "",
    "Total reviews": "2,895"
}