{
    "Product title": "3 Pack Wall Mount Soap Tray for Shower, Adhesive Carbon Steel Soap Dish for Soap, Mobile Phones, Perfume, Toiletries, Brushes, Razors, Watches, Keys, Glasses, Shower Wall Organizer (Gun Grey)",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FYNPJ1KZ?tag=aijento-20",
    "Price": "$11.99",
    "Current Price": "$11..99",
    "Was": "$14.99",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "",
    "Brand": "Consss",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61kxDhZaTZL._AC_SL1300_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/711truJirQL._AC_SL1300_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71IhmsPSajL._AC_SL1300_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71orZSz0VvL._AC_SL1300_.jpg",
    "Key Features": "1. 【Multi functional applicability】： The soap holder is suitable for various daily living places such as bathrooms, kitchens, terraces, laundry rooms, garages, gardens, etc. It can be set up on the washbasin, toilet seat, storage cabinet side, etc., for storing soap, razors, watches, keys, wallets, glasses, toiletries and other small items. | 2. 【Durable and sturdy】： The soap holder is made of carbon steel material, with a stable structure and long service life. Its surface is smooth, the edges are rounded, and combined with the upward curved edge design on both sides, it effectively prevents items from slipping off. | 3. 【Non destructive installation】： The soap holder is equipped with double-sided adhesive tape, which supports tool free and drill free adhesive installation. Suitable for smooth walls, the wall is in a dry state before installation, making the installation process easy and fast. | 4. 【Drainage and moisture prevention】： The bottom of the soap rack is designed with drainage holes, which can quickly drain water and keep the rack dry, making it particularly suitable for use in humid shower environments. | 5. 【Expand space】： The soap holder adopts a small wall installation design with exquisite dimensions (about 11.7 cm x 7.5 cm), which can effectively expand the wall space and provide a practical solution for walls that need to increase small storage areas. Two sets can also be designed with different spacing to form two layers for storing items according to needs.",
    "ASIN": "B0FYNPJ1KZ",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FYNPJ1KZ?tag=aijento-20",
    "Video": "",
    "comment 1": "",
    "comment 2": "",
    "comment 3": "",
    "comment 4": "",
    "comment 5": "",
    "Keyword": "soap dish",
    "Status": "",
    "Total reviews": "2,895"
}