{
    "Product title": "Tension Curtain Rods No Drilling, Extra Long Tension Rod 41-139 Inch, Heavy Duty Shower Curtain Rod for Outdoor Patio Bathroom Windows Room Divider, Adjustable, Anti-Slip, No Rust, Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0G4Q17QX5?tag=aijento-20",
    "Price": "$45.99",
    "Current Price": "$45..99",
    "Was": "$55.99",
    "Discount": "-18%",
    "Rating": "4.6 / 5.0",
    "Total review": "-45",
    "Brand": "FADOTY",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/611RgAZ-l2L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/717H3yKFQzL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71BJBXwSbcL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/718sS3hv2qL._AC_SL1500_.jpg",
    "Key Features": "Effortlessly Adjusts in Seconds: FADOTY tension curtain rod features a 1-click adjustment through the upgraded internal locking design, compared to traditional ways the adjustment is more convenient and faster, easier installation | 75LB Heavy-Duty Support: Made from sturdy and durable carbon steel, these curtain rods for windows won't bend up to 75LB loaded; Multi-layer water and rust proof coating offers a longer lifespan, 1.29-inch rod diameter fits most curtain hooks and curtain holes | Upgrade Non-Slip End Pad: Triangular structure end provides more stability for this tension rod, larger rubber non-slip soft pad grips firmly to the wall, won't fall with hanging heavy curtains, clothes, decorations, or other heavy items | No-Drill & Easy Installation: Installing this shower rod only requires three steps: 1. Assemble, 2. Adjust, 3. Tighten, no tools and drilling needed, ideal for both homeowners and renters, compatible with tile, painting, drywall, glass, and wood, etc. | Suitable for Multi-Sinarios: This multifunctional shower curtain rod range 41\"-139\"(1.29-inch rod diameter) is ideal for both indoor and outdoor applications, suitable for bathrooms, windows, bedrooms, living room, room divider, patios, pergolas, hanging decoration, among other locations",
    "ASIN": "B0G4Q17QX5",
    "Affiliate Link:": "https://www.amazon.com/dp/B0G4Q17QX5?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/99eae275-f156-4f74-9e46-c7e947541edb/default.jobtemplate.hls.m3u8",
    "comment 1": "Doesn’t fit a certain slot-size. My window is 70.5” and should fit well within the 41”-139” that it claims. However with just the adjustable rod it only goes to 65”, then when I attach the long extension rod (they didn’t send me a short) it makes it 73.5”, which is too long. Very frustrating. Contacted the company as I feel like it should’ve come with a short extension rod too, then I’d be able to make it fit. Will change the review if the company sends me the short extension to fix things.*Update*Seller was VERY responsive and sent the right part out immediately. It fits perfectly and securely in my window and it feels very stable. Great option for people who are renting who don't want to do any damage to the walls. - Emily",
    "comment 2": "Brilliant design. Very simple to use.  Very well built and very sturdy.  👍👍👍 - Amazon Customer",
    "comment 3": "Nice sturdy bar. - Scott s.",
    "comment 4": "Works perfect but make sure to measure your space, mine was almost too short for this rod. - Brian C. Jones",
    "comment 5": "Its sturdy! - Sandralee",
    "Keyword": "tension curtain rod",
    "Status": "",
    "Total reviews": "2,895"
}