{
    "Product title": "JASAI 2PACK 18 Oz Glass Soap Dispenser with Rust Proof Stainless Steel Pump, Refillable Hand Soap Dispenser with Vertical Stripe, Premium Bathroom soap Dispenser for Kitchen & Bathroom",
    "Buy on Amazon": "https://www.amazon.com/dp/B0B5TYRW23?tag=aijento-20",
    "Price": "$14.99",
    "Current Price": "$14..99",
    "Was": "$7.50",
    "Discount": "",
    "Rating": "4.6 / 5.0",
    "Total review": "-26,155",
    "Brand": "JASAI",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/7153lOzyslL._AC_SL1201_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/61Gb1hZySXL._AC_SL1001_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61HaMyfgW+L._AC_SL1201_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71Lpz+HuItL._AC_SL1001_.jpg",
    "Key Features": "ATTRACTIVE BATHROOM ACCESSORIES: Stylish Bathroom Soap Dispenser With Blank Wooden Tag. Lovely Way To Dress Up Your Bathroom, Kitchen And Office Etc. | GREAT VALUE SET OF 2: Sizable 18oz Soap Dispenser Houses A Generous Amount Of Soap, Lotion, Hand Soap and Dish Soap. Looks Elegant In Pairs. | GLASS SOAP DISPENSER WITH STURDY PUMP: Durable Thick Glass Soap Dispenser Comes With Rust Proof 304 Stainless Steel Pump. Each Dispenser Pump Holds 18 Ounces Of Liquid. | BEAUTIFUL HAND SOAP DISPENSER: A Distinctive Reflection Through Vertical Ripple Sparkles Under Light And Soap Color Makes Your Home Space Look Pretty And Yet Functional. | DIMENSIONS: Each Glass Soap Dispenser Measures 7.7\" In Height, 3.2\" In Diameter. The Practical And Beautiful JASAI Dispenser Bottler Is A Perfect Gift For Close Friends Or Relatives.",
    "ASIN": "B0B5TYRW23",
    "Affiliate Link:": "https://www.amazon.com/dp/B0B5TYRW23?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/454c7039-a437-4d42-be55-86ddb08671a8/default.jobtemplate.hls.m3u8",
    "comment 1": "Wife had bought something like this at a discount store and the pump part did not work and was plain. This one looks nice in our kitchen and works perfect for our dish soap as a dispenser. Price was cheaper then the one at the discount store. This one also held a lot more soap then the other one. Good item - Paul Campa",
    "comment 2": "This is a beautiful, simple, yet classy looking, quality soap dispenser with hat works great! - An honest American",
    "comment 3": "Really nice item. I bought for a bathroom double sink and they are really pretty! I have had several months and the metal still looks great( that was my biggest concern). Easy to refill and the glass is thick so I am not worried about it easily breaking. Came with little rope tags with a wooden disc on it that I didn’t know what to do with so I just took them off. - Amazon customer.",
    "comment 4": "This is a nice soap dispenser.  It has a classic look that dresses up the bathroom and the dispenser dispenses easily.  I save money by buying bulk liquid soap and using this instead of buying disposable bottles every time which don’t even look as nice. - Lmfs",
    "comment 5": "Perfect soap dispenser if you are looking for something durable but clean and modern. It has a thick and durable glass (it makes it heavy but you know it will not break easily). The pump works with no real force and effect. Clear color with the silver pump makes it look modern and nice. Holds a lot of soap with the large capacity. Great purchase - Carlo K",
    "Keyword": "soap dispenser",
    "Status": "",
    "Total reviews": "2,895"
}