{
    "Product title": "Bath Tub and Shower Mats, Non Slip 40 x 16 Inch Extra Long Bathtub Mat, Machine Washable Bathmat with Drain Holes, Suction Cups for Bathroom Floor, Black",
    "Buy on Amazon": "https://www.amazon.com/dp/B0CFJTY2C5?tag=aijento-20",
    "Price": "$16.99",
    "Current Price": "$16..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.4 / 5.0",
    "Total review": "-5,646",
    "Brand": "TEESHLY",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/81O2AEXe18L._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/714dhTzQeeL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71DJSgB-NJL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71ecS1NUITL._AC_SL1500_.jpg",
    "Key Features": "NON-SLIP LARGE BATH MAT: Our non-slip large bath mat offers superior coverage with its 40 x 16-inch size, maximum coverage for the bathtub floor. Equipped with 362 special large suction cups, this mat securely stays in place on smooth, clean surfaces, making it ideal for home, spa, sauna, gym baths, and showers. | FUNCTIONAL BATHROOM MAT: Our versatile bath mat features a domed design resembling pebbles, offering a massage-like experience during shower time. The irregular texture on the surface enhances friction and prevents slipping. Additionally, with 327 big drain holes, water circulation is optimized and smoother drainage. | SAFETY SHOWER MAT: Our bath mat is made of high quality soft-touch PVC, ensuring a safe and wonderful bathing experience. It is especially suitable for the elderly, children and babies. In addition this bathmat is available in a variety of colors to add a splash of color to your bathroom decor. | MACHINE WASHABLE: Conveniently machine-washable and easy to maintain, this non-slip bath tub mat can be effortlessly cleaned. Simply toss it into the machine with gentle detergent and wash it on a cold water setting. Afterward, hang it to dry. We recommend periodically rinsing and air-drying the shower mat. | TIPS FOR OPTIMAL USAGE: Before use, make sure to clean the surface thoroughly. Place and press the suction cups securely before each use to ensure the mat stays in place. This shower mat is designed to attach only to clean and smooth surfaces, so avoid using it on textured, non-smooth, or refinished surfaces.",
    "ASIN": "B0CFJTY2C5",
    "Affiliate Link:": "https://www.amazon.com/dp/B0CFJTY2C5?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-closed-captions-artifact-us-east-1-prod/closedCaptions/51ed5c90-4231-463f-a01d-d9bef298015f.vtt&quot;,&quot;groupType&quot;:&quot;G1&quot;,&quot;videoPreviewAssets&quot;:&quot;https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a58b6e13-9c85-440d-bdff-98953cad69af/videopreview.jobtemplate.mp4.default.mp4,342X192P_20HZ_350KBPS_VER_1_0,video/mp4,https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a58b6e13-9c85-440d-bdff-98953cad69af/videopreview.jobtemplate.mp4.default.mp4",
    "comment 1": "We had a Munchkin one for my son who is 4 and it kept sliding around. This one has been great. Cleaned the tub well, stuck this down and its not moving. My son feels a lot safer taking a shower now. Its also longer than the other one - Amazon Customer",
    "comment 2": "This may fits perfectly in our long bathtub  it’s easy to clean and non slip. Just bought a second one! - Savanna",
    "comment 3": "This doesn't slip at all. It's great. - Amazon Customer",
    "comment 4": "I was specifically looking for an extra-large mat to cover the entire bottom of our tub, and this one fits the bill perfectly. The 40-inch length is fantastic and provides wall-to-wall coverage, which gives me a lot more peace of mind. The suction cups on the bottom are no joke; once you press it down on a clean, wet surface, this mat does not move at all. The pebble design feels comfortable on my feet, and the drain holes work well, so I don't end up standing in a puddle.My only minor issue is that the top surface itself can feel a little slick when it gets covered in soapy water, so I still find myself being a bit cautious. It's not dangerously slippery, but it's not as grippy as I thought it might be. Also, there was a bit of a plastic smell right out of the package, but it went away after the first wash. Speaking of which, being able to toss it in the washing machine is a huge plus for keeping it clean. Overall, it's a solid mat that does its job well. - KCSP20489",
    "comment 5": "The length is perfect.  It lays perfectly in my tub the whole lengthStays put and doesn't slide.Great product - Fran",
    "Keyword": "shower mat",
    "Status": "",
    "Total reviews": "2,895"
}