{
    "Product title": "Snowflakes Shower Curtains Red White Christmas Abstract Xmas Snow Bathroom Decor Winter Holiday Festival New Year Rustic Farmhouse Kids Shower Curtain Waterproof Fabric with Hooks,60x72",
    "Buy on Amazon": "https://www.amazon.com/dp/B0FFSJ6DNF?tag=aijento-20",
    "Price": "$17.99",
    "Current Price": "$17..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.7 / 5.0",
    "Total review": "-121",
    "Brand": "Canessioa",
    "Availability": "In stock  Usually ships within 2 to 3 days.",
    "Product Image 1": "https://m.media-amazon.com/images/I/81KBsOfqTYL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/81q8CZm8TEL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/810r60gx8sL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/81HzgE3JawL._AC_SL1500_.jpg",
    "Key Features": "🛀【Premium Material & Pretty Design】--Shower curtain crafted from 100% polyester fabric, which is durable, non-fading and wrinkle-free for long term use. Advanced HD pattern printing technology ensure this unique shower curtain with bright colors and clear images, bring you a pleasant bath time. | 🛀【Shower Curtain Size】-- Shower curtain measures about 60\" L x 72\" W. The standard size is sure to fit most bathtubs and shower stalls. Modern bathroom decor is very suitable for bathrooms in various scenes such as hotels, condo, dormitories, camper, RV and home bathroom. | 🛀【Waterproof Material & Keep Privacy】-- This waterproof shower curtain technique used new water-repellency resistant coating, drops of water fell like pearls. Dry quickly after bathing. High-quality thickened polyester fabric makes the shower curtain breathable but opaque. When you share a bathroom with your family members or roommates, it can provide you a private space and protect your personal privacy. | 🛀【Easy to Install & Care】-- Shower curtain set equipped with strong and durable hook Rings for perfectly support the heavy shower curtain and liner. Each rust-resistant metal grommets which can prevent it from torn when you convenient open and close the shower curtain. Only takes a few minutes to install and disassemble. Machine washable in cold water, hang to dry, do not bleach. Polyester fabric and special dyeing technology can prevent the deformation and fading after washing. | 🛀【After-Sales Service】--If you are not satisfied for any reason, please feel free to contact us. We guarantee to support you 24 hours a day.",
    "ASIN": "B0FFSJ6DNF",
    "Affiliate Link:": "https://www.amazon.com/dp/B0FFSJ6DNF?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/al-na-9d5791cf-3faf/cc33d7c8-03d1-4c81-89fb-4320688af9b0.mp4",
    "comment 1": "Vibrant colors. Looks very nice in my bathroom - Janet Thompson",
    "comment 2": "Very Nice, Good Quality - Gail",
    "comment 3": "Absolutely beautiful! Love it! Looks great in my bathroom! It looks just like the picture! Buy it! You won't be disappointed! - Brian K. Veno",
    "comment 4": "Perfect length and really adds to my gingerbread bathroom for the holiday . Love it. - Courtney AuCoin",
    "comment 5": "Just put this up over my existing shower curtain for the holidays. The fabric is perfect and the colors are crisp and deep. Excellent value for my money and highly recommend it - Kathryn Harcombe",
    "Keyword": "christmas shower curtain",
    "Status": "",
    "Total reviews": "2,895"
}