{
    "Product title": "Bathtub Drain Stopper, Tub Stopper/Bathtub Plug for Tip Toe/Trip Lever/Lift&Turn Tub Drains, Bath Tub Drain Stoppers Designed for 1.5\"-1.72\" Drain Hole w/3 O-Rings,Chrome Plated",
    "Buy on Amazon": "https://www.amazon.com/dp/B0C2BQ4LS5?tag=aijento-20",
    "Price": "$15.99",
    "Current Price": "$15..99",
    "Was": "",
    "Discount": "",
    "Rating": "4.7 / 5.0",
    "Total review": "-1,506",
    "Brand": "Uxoz",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/71noeUdhgeL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71Wnp2SzUcL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71KwkBmCccL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71YkFIl21mL._AC_SL1500_.jpg",
    "Key Features": "Uxoz Drain Stopper- The Universal bathtub drain stopper & plug is rigorously tested by professionals and is compatible with most tub drains , including lift-and-turn, tip toe, and trip lever drains. You can replace these three different sizes of rubber rings according to the size of your bathtub drain hole, to ensure a perfect fit for your 1.5'' to 1.72'' tub drains. | Bathtub Drain Stopper- Crafted from solid brass metal and coated with a corrosion-resistant finish, this Tub drain stopper from Uxoz offers superior durability and strength, ensuring long-lasting performance even in wet environments. | Tub Stopper- Designed for easy installation and removal without the need to remove the old drain, the Pop-Up Bath tub drain stoppers from Uxoz is also easy to clear in case of any blockages, providing hassle-free operation. | Bathtub Drain Plug- Available in various colors, the Uxoz bathtub drain stopper replacement adds a stylish touch to your bathroom decor, seamlessly blending in with your existing fixtures and enhancing the overall aesthetic appeal of your space. | Bath Tub Drain Stoppers- We believe in the quality of our bathroom tub stopper. We highly value customer satisfaction and feedback. If you have any questions, please feel free to contact us, and we will respond to your inquiries within 24 hours.",
    "ASIN": "B0C2BQ4LS5",
    "Affiliate Link:": "https://www.amazon.com/dp/B0C2BQ4LS5?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/dc781107-ee89-4373-a5f2-263239771ca8/default.jobtemplate.hls.m3u8",
    "comment 1": "Pleasantly surprised by how nice this is! It was easy to pick the size of the rubber ring to get a secure fit, and literally all you do is set it down in the drain. The materials are substantial, heavy, quality materials, and it really stops the water flow. It’s easy to click it open after a bath, and it’s been easy to clean. This was a great, simple replacement for my old, more complicated pop up drain. - Stacie",
    "comment 2": "Perfect fit, nice finish, opens and closes with a toggling action (click down to close, click down again to open...not just pull up and hope it stays). This is just what I needed to fix a tub drain with the center threaded area that had snapped off. - Mike O",
    "comment 3": "Product works as described and easy to install. - Willie",
    "comment 4": "This was one of the best purchases I ever made. Our stopper that came with the original tub was always getting stuck with a full tub of water that needed drained. This was so easy to install we twisted the old stopper out and dropped this one in and that was it. It seems like a pretty universal fit there’s no threading to screw in to fit so I feel like this would work for just about any tub drain. We bought the oil rubbed bronze finish and it matches all of our other fixtures perfectly. - Anna Smothers",
    "comment 5": "I had been using a plastic tub plug for years. It got knocked off the edge of the tub and my Corgi destroyed it. It was time for a replacement and I came across this stopper. I love it! It keeps water in the tub when taking a bath, it perfectly covers the old chrome around the drain, and it works well to catch hair. - beautifulkitty11",
    "Keyword": "tub stopper",
    "Status": "",
    "Total reviews": "2,895"
}