{
    "Product title": "USHOWER Brushed Nickel Bathroom Hardware Set, Modern 24-Inch Towel Bar Set Wall Mounted, Durable SUS304 Stainless Steel Bathroom Accessories Set, 4-Piece",
    "Buy on Amazon": "https://www.amazon.com/dp/B0C7W2JK3H?tag=aijento-20",
    "Price": "$34.19",
    "Current Price": "$34..19",
    "Was": "$37.99",
    "Discount": "-10%",
    "Rating": "4.6 / 5.0",
    "Total review": "-1,062",
    "Brand": "USHOWER",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/61v7nLth4UL._AC_SL1500_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/71-MbTzsndL._AC_SL1500_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/71PgIZGbzHL._AC_SL1500_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/71iPLOYui6L._AC_SL1500_.jpg",
    "Key Features": "【Warm Tip】 The nickel towel bar is SPLIT INTO 2 PARTS that can be assembled. If possible, measure the space before buying. (Total length 26in, fits 24in wall stud) | 【Bathroom Towel Holder Set】 This convenient bath hardware set combines 4 essential bathroom accessories: a 24in towel bar, toilet paper holder, towel ring, and robe hook, allowing you to upgrade your bathroom with ease. | 【Well Organized】 Towel rack for bathroom keeps your shower room organized and tidy, ensuring towels, bathrobes, and tissue rolls are easily accessible and properly stored. | 【Premium Material】 Made of high-quality 304 stainless steel, thicken 0.8in tube diameter, it ensures strong resistance to scratches, corrosion, rust, and tarnish, making it built to last. | 【Sleek Design】 Elevate your bathroom with our modern & stunning towel rack set. The concealed screw design and a brushed nickel finish add a touch of fashion to the bathroom, effortlessly complementing various styles.",
    "ASIN": "B0C7W2JK3H",
    "Affiliate Link:": "https://www.amazon.com/dp/B0C7W2JK3H?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/a3793d05-8ee3-4d3b-881d-d6d283b801dd/default.jobtemplate.hls.m3u8",
    "comment 1": "Very very good quality.  This is far superior to a more expensive set I bought at a big box store locally.  Its heavy duty and looks great and I'm sure it will last.  Highly recommended! - Stomatta",
    "comment 2": "Really Great set. Easy to install - Nat",
    "comment 3": "great quality easy to install. great functionality - Bought but missing some of the glass. I wish we could connect the seller and ask if they could send them. Its beautiful but looks weird with missing glasses.",
    "comment 4": "I love the design and the build quality. The only drawback to this set is that the tissue keeps falling off the tissue holder mount. The design and build quality of this set are truly impressive, showcasing a high level of craftsmanship. However, there is one notable drawback: the tissue holder mount does not securely hold the tissue, causing it to fall off frequently. - Michael Terrell",
    "comment 5": "These look great and are great quality! Very happy with the purchase! - Ryan Bauserman",
    "Keyword": "towel racks for bathroom",
    "Status": "",
    "Total reviews": "2,895"
}