{
    "Product title": "Blanket Ladder for The Living Room and Bedroom, 5ft 8 inch, 6-Tier Wall Leaning Laminate Snag Free Material (Black) Rustic Decorative Farmhouse Blanket Rack, Quilt Rack, Ladder Shelf, Easy Assembly",
    "Buy on Amazon": "https://www.amazon.com/dp/B08P2QPP2F?tag=aijento-20",
    "Price": "$43.99",
    "Current Price": "$43..99",
    "Was": "$49.99",
    "Discount": "-12%",
    "Rating": "4.3 / 5.0",
    "Total review": "-4,633",
    "Brand": "RELODECOR",
    "Availability": "In Stock",
    "Product Image 1": "https://m.media-amazon.com/images/I/51dFbjjoUTL._AC_SL1024_.jpg",
    "Product Image 2": "https://m.media-amazon.com/images/I/612b7SKwRrL._AC_SL1024_.jpg",
    "Product Image 3": "https://m.media-amazon.com/images/I/61Nw1XgCNqL._AC_SL1024_.jpg",
    "Product Image 4": "https://m.media-amazon.com/images/I/61mYfWU+QVL._AC_SL1500_.jpg",
    "Key Features": "PREMIUM LAMINATE MATERIAL - No worry of snags or slivers or cracks from reused wood. Unlike painted ladders the laminate surface will not mark blankets or walls | BEAUTIFUL DECOR PIECE - Our ladder's sleek, modern design and beautiful finish will complement any home decor style and add a touch of elegance to any room. NOTE: not designed as a climbing ladder! decorative or organization purposes only. | MAXIMIZE YOUR SPACE - These wall leaning blanket ladder is designed to allow you to store and display your favorite blankets, towels, and quilts without taking up too much floor space. | EASY TO ASSEMBLE - With simple instructions and all necessary hardware included, you can easily put together our high-quality, sturdy blanket ladder in minutes. | PERFECT GIFTING IDEA- A blanket ladder is a versatile gift that can be given for many occasions such as housewarming, wedding, birthday, Christmas, and Mother’s Day or Father’s Day.",
    "ASIN": "B08P2QPP2F",
    "Affiliate Link:": "https://www.amazon.com/dp/B08P2QPP2F?tag=aijento-20",
    "Video": "https://m.media-amazon.com/images/S/vse-vms-transcoding-artifact-us-east-1-prod/7ccf36ef-2870-4d5b-868a-a28294ecf97d/default.jobtemplate.hls.m3u8",
    "comment 1": "Very nice sturdy blanket ladder! Easy to install! Love it! - Susan P",
    "comment 2": "Absolutely love my blanket ladder! It was initially used for Christmas lights and stockings. I’m now using it for blankets. The assembly is quick and easy and it looks great! - Margarita",
    "comment 3": "Love it! It is a bit crooked in place, maybe how I screwed it in place. It is sturdy for my blankets I want to keep in the living room. the color is cute! Height it perfect and love how hardware was included. Definitely good value! - Hailey",
    "comment 4": "Purchased ‘rustic hickory’ but received ‘smoked hickory’ which is not even a color option/description available. Comes folded up with hinges and straightens out as the rungs are installed. Outer screw holes are covered with stickers that only match certain areas of the posts. I’m sure it will do the job but I felt the picture looked better than the actual product. The boards don’t have a rustic appearance at all which would have matched my other furniture. - MamaFox33",
    "comment 5": "I really like these blanket ladders. I ordered one for my basement and one for my main floor. Good quality on carpet and easy to assemble. I can fit 4 decent sized blankets without them touching the ground. - Danielle R.",
    "Keyword": "blanket ladder",
    "Status": "",
    "Total reviews": "2,895"
}